{
	"stuff":[
		{
		"year": "2016",
		"incidents":[
		{"id": 0, "name": "Kalsang Wangdu", "date":"February 29, 2016", "age":"18", "location":"Nyarong County in Kardze (Chinese: Ganzi)", "status":"Deceased", "lat":"99.59", "lon":"31.37", "img": "http://www.savetibet.org/wp-content/uploads/2016/03/Kalsang-Wangdu-150.jpg", "info": "[While he burned], he called out for Tibet’s complete independence,” a Tibetan source told RFA, adding that witnesses to Wangdu’s protest “intervened,” intending to take him to Sichuan’s provincial capital for treatment.He carried out his self-immolation around 4pm by his monastery, the Retsokha Aryaling monastery. (RFA report,A Tibetan monk named Kalsang Wangdu, aged 18, has died after setting himself on fire on February 29 (2016) in Nyarong County in Kardze (Chinese: Ganzi), eastern Tibet, according to Radio Free Asia."}
		]},
		{
		"year": "2015",
		"incidents":[
	{"id": 0, "name": "Tenzin Gyatso", "date":"May 20, 2015", "age":"Early thirties", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Unknown", "lat":"101", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2015/05/TenzinGyatsoTawu2-0520.jpg", "info": "A Tibetan father of four set fire to himself in Tawu apparently in response to tightened security in the buildup to the Dalai Lama’s 80th birthday. Tenzin Gyatso, the fourth Tibetan to self-immolate this year, was taken away by armed police and it is not known if he is still alive. He set fire to himself outside a government building where political education was carried out, according to Tibetan sources."},
	{"id": 1, "name": "Neykyab", "date":"April 16, 2015", "age":"Forties", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2015/04/neykyab-150.jpg", "info": "The Tibetan man was named by Tibetan sources as Neykyab, believed to be in his forties or fifties. The same sources said that he was the brother-in-law of another Tibetan from Ngaba, Dargye, who set fire to himself in Lhasa on May 27, 2012. A local source from Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) told Radio Free Asia: “He was protesting against Chinese policies in Tibet. His body was taken away by police.” Another source told RFA: “He had received [religious] recognition for his vow not to harm others in personal disputes—a vow that he took in honor of all those who have sacrificed themselves in self-immolation protests for the cause of Tibetan freedom” the source said.”"},
	{"id": 2, "name": "Sangye Tso", "date":"May 27, 2015", "age":"36", "location":"", "status":"Deceased", "lat":"102.9", "lon":"34.9", "img": "http://www.savetibet.org/wp-content/uploads/2015/06/Sangey-Tso-300.jpg", "info": "Sangye Tso set fire to herself and died on May 27 in a township in Chone (Chinese: Zhuoni) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture) in Gansu Province, according to Tibetan sources. The location she chose to self-immolate was significant – outside a government building near the monastery of Tashi Choekhorling in Dorkok township. A Tibetan exile source in contact with Tibetans in the area said: “The specific location was the Party and government offices, including the local police station, symbolic to locals of policies of injustice against Tibetans, as well as the main offices to enforce the crackdown against police protest in 2008."},
	{"id": 3, "name": "Yeshi Kandro", "date":"April 8, 2015", "age":"Forties", "location":"", "status":"Believed Deceased", "lat":"101.9", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Yeshi-Kandro-150.jpg", "info": "A Tibetan nun in her forties called Yeshi Kandro set fire to herself on April 8 in Kardze (Chinese: Ganzi) and is believed to have died, according to Tibetan sources. She called for the long life of the Dalai Lama, for the Dalai Lama to be invited to Tibet, and for freedom for Tibet as she set herself alight, according to the same sources."},
	{"id": 4, "name": "Norchuk", "date":"March 5, 2015", "age":"Late Forties", "location":"", "status":"Deceased", "lat":"104", "lon":"31.7", "img": "http://www.savetibet.org/wp-content/uploads/2015/03/Norshuk-150.jpg", "info": " A 40-year old Tibetan woman set herself on fire and died in a village in Ngaba (Chinese: Aba) on the night of March 5, in the first self-immolation in Tibet this year. Norchuk was from Dowa village in the Trotsik area of Ngaba (Chinese: Aba) county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan (in the Tibetan area of Amdo). Unusually, her body was not taken by the authorities but local people cremated her remains the next morning in order to pay their respects."},
	{"id": 5, "name": "Sonam Tobgya", "date":"July 9, 2015", "age":"Late twenties", "location":"", "status":"Unknown", "lat":"97", "lon":"33", "img": "", "info": "A Tibetan monk in his late twenties, Sonam Topgyal, set fire to himself in the main square of Kyegudo (Yushu) yesterday (July 9), in an atmosphere of heightened security imposed around the period of the Dalai Lama’s 80th birthday on July 6. According Tibetan exile sources, Sonam Topgyal was taken away by armed police while still alive and is believed to be in hospital, although his whereabouts and welfare is not known."},
	{"id": 6, "name": "Tashi Kyi", "date":"August 27, 2015", "age":"55", "location":"", "status":"Deceased", "lat":"102.5", "lon":"35.2", "img": "", "info": "Tibetan mother of four in her mid-fifties who set herself on fire on August 27 and died, apparently as a protest against China’s policies of relocation and demolition of housing. Tashi Kyi, described as a “generous Buddhist” who was “devoted to her family”, was a relative of a prominent monk who escaped into exile after a bold protest in 2008. Although local Tibetans attempted to save her life by extinguishing the blaze, Tashi Kyi died hours after setting herself on fire in her housing compound, a nomad settlement site in Sangkok township, Sangchu (Chinese: Xiahe) in Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu Province. Her body was taken away by the authorities."}		
		]},
		{
		"year": "2014",
		"incidents":[
	{"id": 0, "name": "Kalsang Yeshe", "date":"December 23, 2014", "age":"Late Twenties", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Deceased", "lat":"120", "lon":"29.7", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Kalsang-Yeshe-150x.jpg", "info": "A Tibetan monk known for his work teaching others about Buddhism set fire to himself and died today in Tawu, the Tibetan area of Kham, according to reports from Tibetans in exile. According to the same sources, Kalsang Yeshe self-immolated near a police station that had been established recently by his monastery, Nyitso, where repression of monks and local people has been particularly intense in recent years."},
	{"id": 1, "name": "Tseypey", "date":"December 22, 2014", "age":"19", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Tseypey-1222-150.jpg", "info": "She was identified by exile sources as Tseypey, the fourth of six children from a family in Meruma township, and the same sources say that she died on the scene. Tseypey was described by Tibetans who knew her as “well-behaved, honest and gentle”, according to Kirti monks in exile in Dharamsala. She had not received a formal education but grew up working as a herder with her parents. According to the same sources, her 60 year old father and 50 year old mother have reportedly been taken away by police, but it is not clear whether they have been detained."},
	{"id": 2, "name": "Sangye Khar", "date":"December 16, 2014", "age":"Unknown", "location":"", "status":"Unknown", "lat":"102.5", "lon":"35.2", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Sangye-Khar-150.jpg", "info": "Sangye Khar is believed to be from a semi-nomadic area in Kanlho, Gansu. Details of the self-immolation were sketchy due to security restrictions in the area."},
	{"id": 3, "name": "Lhamo Tashi", "date":"September 17, 2014", "age":"Early twenties", "location":"", "status":"Deceased", "lat":"102.9", "lon":"34.9", "img": "http://www.savetibet.org/wp-content/uploads/2014/09/Lhamo-Tashi-150.jpg", "info": "A Tibetan student, Lhamo Tashi, set fire to himself and has died on September 17 outside a government Public Security Bureau headquarters in Tsoe City, northeastern Tibet, where he was studying. After setting himself on fire at around midnight, Lhamo Tashi, who was in his early twenties, was taken away by police in Tsoe City, the capital of Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture in Gansu Province (the Tibetan area of Amdo)."},
	{"id": 4, "name": "Thinley Namgyal", "date":"April 15, 2014", "age":"32", "location":"", "status":"Deceased", "lat":"109.4", "lon":"19.1", "img": "http://www.savetibet.org/wp-content/uploads/2014/04/Thinley-Namgyal-150.jpg", "info": "A Tibetan man burned himself to death Tuesday in Sichuan province’s restive Kardze prefecture to protest Chinese rule, triggering a security alert and a clampdown on information flow, according to sources. Thinley Namgyal, 32, self-immolated at noon in Khangsar township in Tawu (in Chinese, Daofu) county in Kardze (Ganzi) Tibetan Autonomous Prefecture, the sources said."},
	{"id": 5, "name": "Phagmo Samdup", "date":"February 5, 2014", "age":"Late twenties", "location":"", "status":"Deceased", "lat":"101.4", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2014/02/Pakmo-Samdup-150.jpg", "info": "Phagmo Samdup set fire to himself at around 9:30pm in the evening. It appears that not many people were outside to witness the self-immolation. Police on patrol extinguished the fire and took Phagmo Samdup away, and it is not known if he survived, Tibetan sources said, adding he had been taken to Tsekhog county town."},
	{"id": 6, "name": "Lobsang Palden", "date":"March 16, 2014", "age":"20", "location":"", "status":"Unknown", "lat":"104.2", "lon":"31.3", "img": "http://www.savetibet.org/wp-content/uploads/2014/03/Lobsang-Palden-150.jpg", "info": "The monks, citing local contacts, said Palden self-immolated to protest “against the violent crackdown on the Tibetans” on March 16, 2008 in Ngaba when Chinese police opened fire on a crowd of Tibetans, killing at least 10, including one monk."},
	{"id": 7, "name": "Kunchok", "date":"September 16, 2014", "age":"42", "location":"", "status":"Hospitalized, Tsangkor town in Gade (Chinese: Gande) county in the Prefecture", "lat":"99.3", "lon":"34.1", "img": "", "info": "A 42 year-old Tibetan, Kunchok, set himself on fire outside a police station in the Golog (Chinese: Guoluo) Tibetan Autonomous Prefecture in Qinghai Province on September 16, according information received from Tibet. Kunchok’s self immolation took place in Tsangkor town in Gade (Chinese: Gande) county in the Prefecture but Tibetans nearby managed to extinguish the flames. Kunchok was rushed to hospital, and was deeply distressed that he had survived, according to Tibetan sources. Although the self-immolation happened on September 16, news only reached Tibetans in exile yesterday (October 5) due to restrictions on information and tightened security in the area."},
	{"id": 8, "name": "Dolma", "date":"March 29, 2014", "age":"31", "location":"Bathang county, Sichuan (the Tibetan area of Kham)", "status":"Unknown", "lat":"105", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2014/03/Dolma-0329-150.jpg", "info": "A Tibetan, reported to be 31-years-old, called Dolma set fire to herself outside a monastery on March 29, the first self-immolation in Bathang county, Sichuan (the Tibetan area of Kham). When Tibetans who were circumbulating the Ba Choede monastery, a traditional religious practice, witnessed the self-immolation, they managed to extinguish the flames and take Dolma to hospital."},
	{"id": 9, "name": "Jigme Tenzin", "date":"March 16, 2014", "age":"Late twenties", "location":"Tsekhog (Zeku) county in Qinghai province’s Malho (Huangnan) Tibetan Autonomous Prefecture", "status":"Deceased", "lat":"122", "lon":"36.9", "img": "", "info": "Monk Jigme Tenzin, who was in his late twenties, self-immolated on March 16, 2014 near his monastery, Sonak Gedun Tashi Choling in Tsekhog (Zeku) county in Qinghai province’s Malho (Huangnan) Tibetan Autonomous Prefecture. Jigme Tenzin’s self-immolation was noticed immediately by monks in the monastery, who rushed to extinguish the flames. But Jigme Tenzin died on the scene, and monks were only able to carry his body back to the monastery. After the self-immolation, armed police and officials came to the monastery and detained a group of monks. While some were released later that day, it is not known when the rest were released or whether any monks are still in custody. Patriotic education sessions were held at the monastery, and monks’ movements and religious activities were restricted for around two months. Immediately after the self-immolation, internet access and mobile phone networks were cut off. A Tibetan source who had known Jigme Tenzin for some years told ICT: “Jigme Tenzin had previously studied as a monk at Rongwo monastery in Rebkong and later returned to Sonak Gedun Tashi Choling monastery in his home area. He was a very humble person, and a vegetarian.”"},
	{"id": 10, "name": "Lobsang Dorje", "date":"February 13, 2014", "age":"25", "location":"Ngaba (Chinese: Aba) county town", "status":"Unknown", "lat":"103.8", "lon":"31.6", "img": "", "info": "A former Kirti monk set fire to himself on February 13, on the main road near the monastery in Ngaba (Chinese: Aba) county town, after attending a monastic mask dance that morning. Twenty-five year old Lobsang Dorje was still alive when he was taken away by police. Kirti monks in exile said: “As they were driving him away in the back of a pickup van covered with black canvas, he sat up and joined his palms, but the policemen pushed him back down. At present it is not known whether he is alive or dead, or where he has been taken.” Lobsang Dorje, from Chukle Gongma nomadic area in Cha Ruwa, Ngaba (Chinese: Aba) set fire to himself in the same street as Kirti monk Tapey, who was the first Tibetan in Tibet to self-immolate five years ago this month in February 2009."}
		]},
		{
		"year": "2013",
		"incidents":[
	{"id": 0, "name": "Tsultrim Gyatso", "date":"December 19, 2013", "age":"41", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Deceased", "lat":"102.5", "lon":"35.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/12/Tsultrim-Gyatso-150.jpg", "info": "A Tibetan monk from Amchok Monastery died of self-immolation protest on December 19, 2013 calling for unity among Tibetans and the return of the Tibetan spiritual leader His Holiness the Dalai Lama. He died instantly and soon local Tibetans and monks took his charred body to his monastery. Sources told TCHRD that over 400 monks have gathered at to recite prayers and conduct rituals at the deceased’s residence at the monastery. In his last note, Tsultrim Gyatso wrote that the reasons for his self-immolation protest are to call for the return of His Holiness the Dalai Lama to Tibet, release the 11th Panchen Lama Gedun Choekyi Nyima, and for the welfare of the six million Tibetans."},
	{"id": 1, "name": "Kunchok Tseten", "date":"December 4, 2013", "age":"", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Kunchok-Tseten-150.jpg", "info": "A Tibetan father of two called Kunchok Tseten set fire to himself yesterday (December 3) in Meruma township in Ngaba, sparking protests as local people tried to stop police taking him away after he collapsed in the road in flames. Kunchok Tseten’s wife and some relatives have disappeared and are believed to have been taken into custody, according to Tibetan exile sources. Kunchok Tseten was heard shouting loudly as he ran down the road ablaze, calling for the long life of the Dalai Lama, for His Holiness to return to Tibet and for Tibetans to be reunited both inside Tibet and in exile. A Tibetan with contacts in the area told Radio Free Asia: “Even after he collapsed on the ground, he was seen by local witnesses folding his hands together in prayer and uttering some words that were not audible.”"},
	{"id": 2, "name": "Kunchok Sonam", "date":"July 20, 2013", "age":"18", "location":"", "status":"Deceased", "lat":"117.9", "lon":"27.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/07/Konchok-Sonam-150.jpg", "info": "An 18-year old monk called Kunchok Sonam set himself on fire on July 20 and died outside his monastery in Dzoege, Ngaba, where the crackdown has been among the most intense in Tibetan areas. Kunchok Sonam was regarded as ‘exceptional’ in his studies. He had told friends that living under Chinese rule in Tibet had brought too much suffering. A heavy troop presence has now deployed in Thangkor (Ch: Tangke) town and at the Soktsang (Tashi Thekchokling) Gelugpa monastery in Dzoege (Chinese: Ruo’ergai) in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) where Kunchok Sonam was a monk. Another Tibetan monk, Tangdzin, was detained, according to one Tibetan source. Radio Free Asia reported that hundreds of Tibetans have gathered at the monastery in support of monks who prevented Chinese authorities from taking away his body."},
	{"id": 3, "name": "Losang Dawa", "date":"April 24, 2013", "age":"20", "location":"", "status":"Deceased", "lat":"101.4", "lon":"32.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Lobsang-dawa-01-4242013-150.jpg", "info": "At around 6:40 pm on April 24 2013, two monks of the Taktsang Lhamo Kirti monastery, Losang Dawa, 20, and Konchok Woeser, 23, set themselves on fire in the monastery’s assembly hall. They shouted slogans of protest against the Chinese government and its policies in Tibet, and died immediately. The monks took their bodies to their rooms and said prayers for them. Local authorities have indicated that their remains must be cremated tomorrow."},
	{"id": 4, "name": "Konchok Woeser", "date":"April 24, 2013", "age":"23", "location":"", "status":"Deceased", "lat":"101.5", "lon":"32.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/konchok-woeser-01-4242013-150.jpg", "info": "At around 6:40 pm on April 24 2013, two monks of the Taktsang Lhamo Kirti monastery, Losang Dawa, 20, and Konchok Woeser, 23, set themselves on fire in the monastery’s assembly hall. They shouted slogans of protest against the Chinese government and its policies in Tibet, and died immediately. The monks took their bodies to their rooms and said prayers for them. Local authorities have indicated that their remains must be cremated tomorrow."},
	{"id": 5, "name": "Kalkyi", "date":"March 24, 2013", "age":"30", "location":"", "status":"Deceased", "lat":"101.1", "lon":"32.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Kalkyi-3242013-150.jpg", "info": "A 30-year old Tibetan woman called Kalkyi set fire to herself close to Jonang Gonchen monastery in Dzamthang (Chinese: Rangtang), Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo). Kalkyi died immediately afterwards, according to Tibetan exile sources, and local people took her body to the monastery for prayers."},
	{"id": 6, "name": "Shichung", "date":"September 28, 2013", "age":"40", "location":"Gomang village, Ngaba (Chinese: Aba) county", "status":"Deceased", "lat":"89.8", "lon":"31.4", "img": "http://www.savetibet.org/wp-content/uploads/2013/09/Shichung-150.jpg", "info": "A Tibetan father of two set fire to himself and died on September 28 in Gomang village, Ngaba (Chinese: Aba) county, according to exile Tibetan sources. When Tibetans gathered around his body, police aimed their guns at the crowd. Village elders averted tensions by appealing to both local Tibetans and police for calm. Forty-year old Shichung set himself on fire outside his house and ran along the road shouting in protest against the Chinese authorities before he collapsed to the ground in flames and died, according to Kirti monks in exile in Dharamsala. The monks said before he self-immolated, he lit a butter-lamp before an image of the Dalai Lama. A few days earlier, he had said, “The Chinese will never leave us in peace”, according to the same sources."},
	{"id": 7, "name": "Wangchen Dolma", "date":"June 11, 2013", "age":"Early thirties", "location":"Near Nyatso monastery in Tawu, Kardze Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"99.9", "lon":"31.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Wangchen-Dolma-150.jpg", "info": "A Tibetan nun has died after setting fire to herself on June 11 near a monastery in Tawu, eastern Tibet, during a gathering of several thousand monks for a religious debate and teaching. Wangchen Dolma chose to self-immolate not at her own mountain retreat, Barshab Dragkar, but near Nyatso monastery in Tawu (Chinese: Daofu) in Kardze (Chinese: Ganzi) Tibetan Autonomous Prefecture, Sichuan (the Tibetan area of Kham) at the time of a major inter-monastic debate and teaching. More than 3,000 monks from at least 50 monasteries representing all of the Buddhist schools are attending the teachings. After the self-immolation, communications were restricted in the area and surveillance of monks at Nyatso monastery was intensified."},
	{"id": 8, "name": "Tenzin Sherab", "date":"May 27, 2013", "age":"Early thirties", "location":"Gyaring area of Yushu in Qinghai province", "status":"Deceased", "lat":"97.4", "lon":"34.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tenzin-sherab-150.jpg", "info": "A Tibetan nomad in his early thirties called Tenzin Sherab set fire to himself and died on May 27 in the Gyaring area of Yushu in Qinghai province, according to exile Tibetan sources. Police took Tenzin Sherab’s body from the site of his self-immolation, but according to the same sources, they later released it to the family. The family were questioned on why they thought Tenzin Sherab had self-immolated."},
	{"id": 9, "name": "Chugtso", "date":"April 16, 2013", "age":"20", "location":"Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"101.1", "lon":"32.3", "img": "", "info": ""},
	{"id": 10, "name": "Kunchok Tsomo", "date":"Late March, 2013", "age":"Early forties", "location":"Kyegudo (Chinese: Yushu) Tibetan Autonomous Prefecture, Qinghai province", "status":"Unknown", "lat":"97", "lon":"33", "img": "", "info": "Kunchok Tsomo self-immolated in late March in protest over the planned destruction of her home in Kyegudo, (Chinese: Yushu), in Qinghai, according to Radio Free Asia’s Tibetan service. On April 14, 2010, a 6.9-magnitude earthquake struck the area, killing 2,698 and leaving 100,000 homeless according to the official count. Kunchok Tsomo’s home was among those destroyed by the local authorities as part of the process of rebuilding Yushu as a ‘new city’ following the earthquake. She survived, and is under close official supervision, according to Tibetan sources. She is the third Tibetan from Kyegudo to self-immolate over land-rights issues involved in the reconstruction following the earthquake. According to a Tibetan source, armed police arrived on the scene of Kunchok Tsomo’s self-immolation quickly and extinguished the flames, and removed her to hospital. She was given urgent medical treatment and recovered, according to the same source. She is now back in her home town and under close official scrutiny. It is not known if her land was returned to her or not."},
	{"id": 11, "name": "Konchok Tenzin", "date":"March 26, 2013", "age":"28", "location":"Near Mokri monastery in Luchu (Chinese: Luqu) County, Gannan Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.5", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Konchok-Tendzin-150.jpg", "info": "Konchok Tenzin was a monk at Mokri monastery, which he joined at a young age. Konchok died in the course of the protest, and his body was taken back to the monastery. In fear that the remains would be confiscated by the authorities, they were cremated the same night, according to Kirti monks in exile, in Dharamsala, India. Following the incident, security forces were deployed around the monastery and nearby villages in large numbers, and a strict crackdown imposed. This is the sixth self -immolation protest in Luchu county so far, and all the protesters involved have died as a result."},
	{"id": 12, "name": "Lhamo Kyab", "date":"March 25, 2013", "age":"43", "location":"Sangchu (Chinese: Xiahe), Gannan", "status":"Deceased", "lat":"102", "lon":"35", "img": "", "info": "A Tibetan forest guard set fire to himself and died on March 25 in Sangchu (Chinese: Xiahe), Gannan. The circumstances of his death remain unclear, but due to unofficial information received from the area, ICT includes this death on the list of self-immolations. In contrast to other self-immolators, Lhamo Kyab, a Tibetan man in his early forties, appears to have set fire to himself by pouring petrol over a pile of logs, setting them alight and placing himself amidst the flames, according to Tibetan sources in exile. He died in a rural area near his home in Meshul township, Sangchu (Chinese: Xiahe), Gannan in Gansu Province. An image received from Tibet depicts what can barely be discerned as human remains on bare earth, near a pile of wood, with denuded steep hillsides beyond. By the time he was found little remained of his body."},
	{"id": 13, "name": "Lobsang Thogme", "date":"March 16, 2013", "age":"28", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"102.2", "lon":"31.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Losang-Tokme-150.jpg", "info": "A 28-year old Kirti monk called Lobsang Thogme set fire to himself and died on Saturday, March 16, the fifth anniversary of a protest in Ngaba (Chinese: Aba), eastern Tibet, in which armed police fired into an unarmed crowd. He is the third Kirti monk to set fire to himself on the anniversary of the crackdown in 2008. In a translation from the Tibetan, the Kirti monks in exile said: “Before reaching the gate, he fell to the ground. By that time, many monks and laypeople reached the spot, and he was taken to the county hospital, but passed away soon after. It is not known what he shouted during his protest. On arrival at the hospital, a large force of police and soldiers came there and forcibly took possession of his remains, which they then took to the prefecture headquarters at Barkham (Chinese: Markam).”"},
	{"id": 14, "name": "Kunchok Wangmo", "date":"March 13, 2013", "age":"31", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased. Details of the circumstances of the self-immolation remain unclear. It is not known if Kunchok Wangmo did self-immolate or not, due to restrictions on information and the oppressive political climate.", "lat":"102.3", "lon":"31.9", "img": "", "info": "The Chinese state media Xinhua reported on August 16, 2013, that the Intermediate People’s Court in Ngaba (Aba) Tibetan and Qiang Autonomous Prefecture had sentenced a Tibetan man, 32-year old Dolma Kyab (Chinese transliteration: Drolma Gya) to death for ‘killing his wife and burning her body to make it look as if she had self-immolated.’ Full details of the circumstances of Kunchok Wangmo’s death are not known. The imposition of the death penalty is rare in Tibet and there are concerns that the verdict may have been influenced by political circumstances."},
	{"id": 15, "name": "Sangdag", "date":"February 24, 2013", "age":"Unknown", "location":"On a road which is to the south of Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Unknown", "lat":"102.1", "lon":"32", "img": "", "info": "On February 24, 2013, a monk called Sangdag set fire to himself around 10:00am on a road which is to the south of Ngaba town. Sangdag was from Dowa village in Drotsig Shang, Ngaba Dzong, Ngaba prefecture in Sichuan province and was a monk from the Diphu monastery (Sakya school) in Ngaba Dzong."},
	{"id": 16, "name": "Tsesung Kyab", "date":"February 25, 2013", "age":"Late twenties", "location":"Shitsang Gonsar monastery in Luchu County, Gannan Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.7", "lon":"34.8", "img": "", "info": "Tsesung Kyab set fire to himself on February 25 in front of the main temple of Shitsang Gonsar monastery in Luchu. Harrowing images received from inside Tibet today depict Tsesung Kyab ablaze outside the temple as pilgrims look on. Many Tibetans were at the monastery for a prayer ceremony and ritual in which monks carry the Buddha’s statue and circumambulate the monastery. The images do not depict police attempting to extinguish the flames although, according to Tibetan exile sources, there was a police presence at the monastery. According to the same sources, his body was taken to his home in Choekhor village for prayers."},
	{"id": 17, "name": "Phagmo Dundrup", "date":"February 24, 2013", "age":"Early twenties", "location":"Chachung monastery in Tsoshar Prefecture in Qinghai province", "status":"Deceased", "lat":"102.1", "lon":"36.5", "img": "", "info": "Phagmo Dundrup self-immolated on February 24 evening when hundreds of Tibetans were present at the Chachung monastery, an important and ancient Gelugpa monastery, for a traditional prayer ceremony and presentation of butter-lamps of the Buddha and other deities. According to information from Tibetan sources in exile, monks tried to extinguish the flames after Phagmo Dondrup set himself ablaze. The monks took him to the hospital but he passed away last night in a hospital in Xining."},
	{"id": 18, "name": "Rinchen", "date":"February 19, 2013", "age":"17", "location":"Dzoege township, Ngaba county, eastern Tibet", "status":"Deceased", "lat":"91.6", "lon":"32.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/rinchen-02192013.jpg", "info": "Rinchen, 17 years old Tibetan, died February 19 after setting himself on fire in Ngaba. He was accompanied by Sonam Dhargye, 18 years, who also set himself on fire in protest against the Chinese government in Dzoege township, Ngaba county, eastern Tibet around 9.30pm (local time). According to the same sources, the families were able to recover their bodies. Rinchen and Sonam both went primary school in Kyangtsa township. Rinchen had been working away from home and returned for the Tibetan New Year (Losar) holiday."},
	{"id": 19, "name": "Sonam Dhargye", "date":"February 19, 2013", "age":"18", "location":"Dzoege township, Ngaba county, eastern Tibet", "status":"Unknown", "lat":"91.7", "lon":"32.5", "img": "", "info": "Rinchen, 17 years old Tibetan, died February 19 after setting himself on fire in Ngaba. He was accompanied by Sonam Dhargye, 18 years, who also set himself on fire in protest against the Chinese government in Dzoege township, Ngaba county, eastern Tibet around 9:30pm (local time). According to the same sources, the families were able to recover their bodies. Rinchen and Sonam both went primary school in Kyangtsa township. Rinchen had been working away from home and returned for the Tibetan New Year (Losar) holiday."},
	{"id": 20, "name": "Namlha Tsering", "date":"February 17, 2013", "age":"49", "location":"Labrang, Gansu (the Tibetan area of Amdo)", "status":"Unknown", "lat":"105.2", "lon":"35.2", "img": "", "info": "A 49-year old Tibetan man called Namlha Tsering set himself on fire today in the main street of Labrang, Gansu (the Tibetan area of Amdo), which is not far from Labrang monastery. Images emerged showing a man huddled on the road amidst traffic with his body ablaze. Chinese police and paramilitary arrived quickly on the scene and removed Namlha Tsering. It is not yet known whether he is still alive."},
	{"id": 21, "name": "Drugpa Khar", "date":"February 13, 2013", "age":"Twenties", "location":"Amchok town in Sangchu (Xiahe) county in Kanlho (Gannan) Tibetan Autonomous Prefecture, Gansu", "status":"Deceased", "lat":"102.5", "lon":"34.9", "img": "", "info": "Drugpa Khar, who was in his twenties, doused himself in gasoline and set himself on fire in Amchok town in Sangchu (Xiahe) county in Kanlho (Gannan) Tibetan Autonomous Prefecture, Gansu, on the third day of Tibetan New Year (February 13), according to Tibetan sources in exile and Radio Free Asia’s Tibetan language service. Drugpa Khar was a father of three children aged between one year old and six. He was born in Lushu Kyi village in Tsoe, Kanlho, the Tibetan area of Amdo."},
	{"id": 22, "name": "Lobsang Namgyal", "date":"February 3, 2013", "age":"Mid-thirties", "location":"Outside the Public Security Bureau of Dzoege (Chinese: Ruergai/Zoige) County in Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan Province", "status":"Deceased", "lat":"101.7", "lon":"31.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/lobsang-namgyal-150.jpg", "info": "Lobsang Namgyal had been a monk at Kirti monastery in Ngaba, his ashes have not been returned to his family, according to the monks. Lobsang Namgyal was known as an exceptional student at Kirti monastery who had been tipped to study for the highest qualification in Tibetan Buddhism, a Geshe degree. “He was regarded as a model for a new generation of students at Kirti,” the Kirti monks in exile said in a statement in Tibetan."},
	{"id": 23, "name": "Konchok Kyab", "date":"January 22, 2013", "age":"26", "location":"Bora, Sangchu county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.7", "lon":"35.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Konchok-Kyab-01222013-150.jpg", "info": "Konchok Kyab [also known as Konba], age 26 set fire to himself around noon on January 22 to protest China’s policy on Tibet and he passed away after the incident. Konchok Kyab set fire to himself between the local moanstery and Bora Shang, Konchok Kyab was from the Gyara village in Bogtsa unit in Bora Shang, Sangchu Dzong, Gannan prefecture in Gansu province."},
	{"id": 24, "name": "Tsering Phuntsok", "date":"January 18, 2013", "age":"Twenties", "location":"Drachen village, Marthong county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province", "status":"Deceased", "lat":"101.5", "lon":"32", "img": "", "info": "A man in his twenties who has been named as Tsering Phuntsok (also known as Drupchak) set himself on fire in Drachen village, Marthong county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province. He passed away at the scene and his body was taken away by Chinese police, according to Tibetan exile sources. He is survived by his wife and two children."},
	{"id": 25, "name": "Tsering Tashi", "date":"January 12, 2013", "age":"22", "location":"Main street of Amchok township, Sangchu (Chinese: Xiahe) county, Gannan Tibetan Autonomous Prefecture, Gansu province (the traditional Amdo area of Tibet)", "status":"Deceased", "lat":"102.2", "lon":"34.7", "img": "", "info": "Following Tsering Tashi’s self-immolation in the main street of Amchok township on January 12, Chinese police and Public Security Bureau officials arrived in several vehicles. They barred the monks of Amchok monastery and local lay Tibetans from offering prayers and ordered Tsering Tashi’s family members to cremate the body as soon as possible. When the family initially said that they needed to perform the customary religious rituals for a death, they were threatened and told that they would be responsible for the consequences if they refused. Tsering Tashi was married to Yumtso Kyi and is survived by his wife, parents and two sisters. He was described by Tibetans who knew him as “good-natured and polite” with a keen passion for horses and horse racing."}
	]},
		{
		"year": "2012",
		"incidents":[
	{"id": 0, "name": "Wangchen Kyi", "date":"December 9, 2012", "age":"17", "location":"Dokarmo nomadic area of Tsekhog (Chinese: Zeku) county in Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102", "lon":"35.5", "img": "", "info": "Seventeen year old student Wangchen Kyi died after setting fire to herself at around 8 pm in the evening on December 9 in the Dokarmo nomadic area of Tsekhog (Chinese: Zeku) county in Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai (the Tibetan area of Amdo. Wangchen Kyi called for the long life of the Dalai Lama and of the Tibetan people as she set herself ablaze, according to reports from exile Tibetans in contact with people in the area."},
	{"id": 1, "name": "Kunchok Pelgye", "date":"December 8, 2012", "age":"24", "location":"Taktsang Lhamo Kirti monastery in Dzoege, in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo)", "status":"Deceased", "lat":"101.5", "lon":"30", "img": "", "info": "24-year old monk Kunchok Pelgye set himself on fire outside the main assembly hall of the Taktsang Lhamo Kirti monastery in Dzoege, in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo). Kirti monks in exile told ICT: “As he self-immolated, monks present gathered around him in shock and began to recite a prayer that is usually said in Kirti Rinpoche’s honor. His remains were carried back to his room in the monastery, and the hundreds of monks present continued to chant prayers dedicated to him.”"},
	{"id": 2, "name": "Pema Dorjee", "date":"December 8, 2012", "age":"23", "location":"Close to the main assembly hall of Shitsang Garser monastery in Luchu (Chinese: Luqu) in Gannan Tibetan Autonomous Prefecture, Gansu province.", "status":"Deceased", "lat":"102", "lon":"34.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/pema-dorjee-150.jpg", "info": "Pema Dorjee lived around 30 kilometers from the monastery and had gone there to pray at the time of the anniversary of Tsongkhapa’s passing. At the time of his self-immolation there were many people at the monastery. Pema Dorjee shouted that the Dalai Lama should be allowed to return to Tibet, and called for the unity of the Tibetan people. According to Tibetan exile sources, Pema Dorjee left his photos and identity card with his motorbike before his self-immolation."},
	{"id": 3, "name": "Lobsang Geleg", "date":"December 3, 2012", "age":"29", "location":"Pema county town, Golog prefecture, Qinghai province", "status":"Deceased", "lat":"99.3", "lon":"34.3", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/lobsang-gendun-150.jpg", "info": "Lobsang Geleg, aged 29, set fire to himself on December 3 at the main intersection in Pema county town and died at the scene. Before his death Lobsang Geleg shouted slogans and looked to bring his hands together in prayer, according to a local Tibetan who spoke with Tibetans in exile. In what has become an increasingly common response, state security personnel attempted to remove Lobsang Geleg’s body, but were stopped by a gathering of local Tibetans, who took the body to the local monastery for prayers. Lobsang Geleg (informally known as Loge) was a monk at Pema Gonka Dagtroe Lin monastery, in Pema (Chinese: Padma) county, Golog (Chinese: Guoluo) Tibetan Autonomous Prefecture, Qinghai province."},
	{"id": 4, "name": "Sungdue Kyab", "date":"December 2, 2012", "age":"17", "location":"Bora", "status":"Survived", "lat":"102.4", "lon":"36", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/sungdue-kyab-150.jpg", "info": "A young Tibetan man set fire to himself along the road to Bora monatery, in Sangchu county, on December 2, according to Tibetans in exile in contact with Tibetans in Tibet. Sungdue Kyab, 17-years old, is married with a 2-year old son. Sungdue Kyab survived his protest and was taken away by police, reportedly to the hospital in the city of Tsoe in Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province. Local Tibetans and monks from Bora monastery gathered at the site of the protest, when the scene became very tense, according to the same Tibetan sources."},
	{"id": 5, "name": "Kunchok Kyab", "date":"November 30, 2012", "age":"29", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Presumed deceased", "lat":"102.3", "lon":"31", "img": "", "info": "Kunchok Kyab, a 29 year old man, carried out a self-immolation protest on November 30, 2012 in Ngaba. Kyab was taken away by security forces and his condition is unknown at present. A number of Tibetans who approached the security forces to demand the return of Kunchok Kyab are missing and presumed to be detained."},
	{"id": 6, "name": "Tsering Namgyal", "date":"November 29, 2012", "age":"31", "location":"Luchu region of eastern Tibet", "status":"Deceased", "lat":"104.5", "lon":"35.4", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tsering-namgyal-150.jpg", "info": "Sources have identified the Tibetan as Tsering Namgyal, 31, a father of two, from Zamtsa Lotso Dewa region of Luchu. “Tsering Namgyal set himself on fire near the local Chinese government office in Luchu earlier today for the cause of Tibet,” Sonam, a Tibetan monk living in south India told Phayul, citing sources in the region. “Tsering Namgyal passed in his fiery protest.”"},
	{"id": 7, "name": "Wande Khar", "date":"November 28, 2012", "age":"21", "location":"Tsoe region of Kanlho, eastern Tibet", "status":"Deceased", "lat":"102.8", "lon":"36.2", "img": "", "info": "According to eyewitnesses, Wande Khar raised slogans calling for the return of His Holiness the Dalai Lama to Tibet, the release of Panchen Lama, freedom for Tibet, and the protection of Tibet’s environment."},
	{"id": 8, "name": "Sanggye Tashi", "date":"November 27, 2012", "age":"18", "location":"Sang Khog, Labrang [Tib:Sangchu Zdong Ch: Xiahe Xian], Gannan prefecture in Gansu province", "status":"Deceased", "lat":"103", "lon":"36.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/sanggye-tashi-150.jpg", "info": "Details are still emerging."},
	{"id": 9, "name": "Kelsang Kyab", "date":"November 27, 2012", "age":"24", "location":"Kyangtsa township, Ngaba", "status":"Deceased", "lat":"101.9", "lon":"31.7", "img": "", "info": "During the early evening hours of November 27, Keslang Kyab self-immolated in protest outside a government office building in Kyangtsa township in Ngaba, according to Tibetan monks living in exile who are in contact with Tibetans in the area. As Kelsang Kyab neared the government office building, he doused himself with petrol and shouted slogans, including, “May the Dalai Lama live for 100 aeons! May Kirti Rinpoche live for 100 aeons!” He set himself alight as he approached the front of the building and died at the scene. Following the protest, armed security forces were deployed and blocked off the town of Kyangtsa. The 24-year old Kelsang Kyab was the third of six children and grew-up a herdsman. Following his self-immolation, local Tibetans returned his body to his home near Kyangtsa township in Dzoege (Chinese: Ruanggui) county, Ngaba (Chinese: Aba) Tibetan Autonomous Prefecture, Sichuan province."},
	{"id": 10, "name": "Gonpo Tsering", "date":"November 26, 2012", "age":"24", "location":"Luchu county, Kanlho prefecture, Gansu province", "status":"Unknown", "lat":"102", "lon":"36.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/gonpo-tsering-150.jpg", "info": "Details are still emerging."},
	{"id": 11, "name": "Kunchok Tsering", "date":"November 26, 2012", "age":"18", "location":"Labrang, Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo)", "status":"Deceased", "lat":"99", "lon":"39", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/kunchok-tsering-150.jpg", "info": "Kunchok Tsering, 18, passed away in his self-immolation protest today in Amchok region of Labrang, eastern Tibet. He carried out his protest near a mining site in the region, the same place where Tsering Dhondup, 35, father of three, passed away in his fiery protest on November 20. Kunchok Tsering is survived by his wife, Sangay Tso, 19 and parents Phagkyab, 40 and Gonpo Tso, 37, and an elder brother."},
	{"id": 12, "name": "Wangyal", "date":"November 26, 2012", "age":"Twenties", "location":"Serthar, north-eastern Tibet", "status":"Unknown", "lat":"97", "lon":"36", "img": "", "info": "Wangyal, a Tibetan man in his 20s, have set himself on fire in protest against the Chinese government in Serthar, north-eastern Tibet. Wangyal set himself on fire in front of the golden-horse statue at the local ground in Serthar. Chinese authorities immediately arrived at the immolation site and took away Wangyal’s body, eyewitnesses said. His current whereabouts and status is unavailable."},
	{"id": 13, "name": "Sangay Dolma", "date":"November 25, 2012", "age":"Unknown", "location":"In front of the Chinese government office in Dokarmo town of Tsekhog, Malho, eastern Tibet", "status":"Deceased", "lat":"102.4", "lon":"35.5", "img": "", "info": "A Tibetan nun set herself on fire in an apparent protest against China’s occupation of Tibet on Sunday, November 25. Sources tell Phayul that Sangay Dolma, a nun, passed away in her self-immolation protest in front of the Chinese government office in Dokarmo town of Tsekhog, Malho, eastern Tibet. The exact time of her self-immolation protest could not be ascertained immediately."},
	{"id": 14, "name": "Tamdrin Kyab", "date":"November 23, 2012", "age":"23", "location":"Luchu township, Gansu province", "status":"Deceased", "lat":"102.5", "lon":"34.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tamdrin-Kyab-150.jpg", "info": "Tamdrin Kyab, 23-years old, was formerly a monk at Shitsang monastery. He disrobed in 2007 to help his nomadic family. Tamdrin Kyab set fire to himself at around 10 p.m. near the Luchu river. According to exile Tibetan sources, local people did not know about his self-immolation because it happened at night, and it was only in the morning that people found his body and took it back to his home. Local Tibetans and monks from Shitsang monastery gathered at his home to pray and offer their condolences."},
	{"id": 15, "name": "Tamdrin Dorjee", "date":"November 23, 2012", "age":"29", "location":"In front of a government building in Dokarmo in the Tsekhog area of Rebkong, Qinghai province", "status":"Deceased", "lat":"103", "lon":"35", "img": "", "info": "Tamdrin Dorjee, self-immolated on November 23. He was from Makor village in Dokarmo township, in the Tsekhog area of Rebkong (Chinese: Tongren), Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture, Qinghai province. According to a Tibetan exile source, “As the flames blazed higher, he could be seen putting his hands together in prayer, shouting long life to the Dalai Lama.”"},
	{"id": 16, "name": "Lubhum Gyal", "date":"November 22, 2012", "age":"18", "location":"Dowa township, Rebkong", "status":"Deceased", "lat":"102", "lon":"34", "img": "", "info": "On November 22, Lubhum Gyal, age 18, died after setting himself ablaze in the main street of Dowa township in Rebkong. Tibetans gathered at the scene of Lubhum Gyal’s self-immolation. Then, disregarding official warnings, they took his body for cremation near Dowa monastery where monks conducted prayer rituals."},
	{"id": 17, "name": "Tsering Dundrup", "date":"November 20, 2012", "age":"24", "location":"Labrang, Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo)", "status":"Unknown", "lat":"105", "lon":"36", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tsering-dundrup-150.jpg", "info": "Tsering Dundrup set fire to himself around 9:00am and he was in his thirties. Tsering Dundrup was both a farmer and nomad and he is from Chungan village in Amchok Shang, Labrang [Chinese: Xiahe county], Ganlho prefecture, Gansu province."},
	{"id": 18, "name": "Wangchen Norbu", "date":"November 19, 2012", "age":"25", "location":"Kangsta, Qinghai (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102", "lon":"35.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Wangchen-Norbu-150.jpg", "info": "Wangchen Norbu, 25, died after burning himself on November 19, 2012 around 8 pm in Kangtsa (Chinese: Gangca), an area adjacent to the hometown of the late Panchen Lama in Tsoshar (Chinese: Haidong) region in Yazi (Chinese: Xunhua) county, Amdo (Chinese: Qinghai). Sources in the region say that Norbu set himself ablaze near Kangtsa Gaden Choephelling Monastery and shouted slogans calling for the return of the Dalai Lama to Tibet, release of the Panchen Lama and freedom for Tibet."},
	{"id": 19, "name": "Sangdag Tsering", "date":"November 17, 2012", "age":"24", "location":"A township in Tsekhog, Rebkong (Chinese: Tongren), Qinghai", "status":"Deceased", "lat":"103", "lon":"36", "img": "", "info": "A 24-year old Tibetan, Sangdag Tsering, set fire to himself and died on November 17 in a township in Tsekhog in Rebkong, Qinghai. He was the second Tibetan to self-immolate on November 17, following the death of mother of two Chagmo Kyi. Sangdag Tsering self-immolated at around 7 p.m. on November 17 outside a government building in Dokar Mo township in Tsekhog (Chinese: Zeku/Zekog) county, which neighbors Rebkong (Chinese: Tongren), in Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai (the Tibetan area of Amdo). Security personnel at the scene attempted to douse the flames with water but failed. Sangdag Tsering was married with a three-year old son. A Tibetan in exile said that Sangdag Tsering frequently spoke about the Dalai Lama not being allowed to be in Tibet, that Tibetans have no rights, and that the Panchen Lama is still in prison, referring to the young man recognised by the Dalai Lama as the 11th Panchen Lama who disappeared into Chinese custody at the age of six in 1995."},
	{"id": 20, "name": "Chagmo Kyi", "date":"November 17, 2012", "age":"Unknown", "location":"Dolma Square, Rebkong (Chinese: Tongren), Qinghai", "status":"Deceased", "lat":"", "lon":"104", "img": "34.5", "info": "A Tibetan mother of two, Chagmo Kyi, self-immolated on November 17 at around 4 pm and died in Dolma Square, Rebkong (Chinese: Tongren), Qinghai. Local lay Tibetans and monks gathered to mark Chagmo Kyi’s death despite an intense military buildup in the area following peaceful protests and other self-immolations over the past week. According to Tibetan sources hundreds of Tibetans attended her cremation, at a site normally used for the cremation of monks and lamas. They were surrounded by troops."},
	{"id": 21, "name": "Khabum Gyal", "date":"November 15, 2012", "age":"18", "location":"Rebkong, Qinghai province", "status":"Deceased", "lat":"102.1", "lon":"32.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/kharbum-gyal-150.jpg", "info": "On the morning of November 15, 18-year old Khabum Gyal self-immolated near the town of Rebkong and passed away. Following the incident, local people and monks from nearby Gartse monastery took Khabum Gyal’s body to the monastery for prayers and cremation. The teenaged Khabum Gyal, from the nearby village of Chukya, was the second youngest of seven children."},
	{"id": 22, "name": "Tenzin Dolma", "date":"November 15, 2012", "age":"23", "location":"Rebkong (Chinese: Tongren), Qinghai", "status":"Deceased", "lat":"102.5", "lon":"31.9", "img": "", "info": "Tangzin Dolma, 23, set herself ablaze at around 12 pm (local time) [November 15] in Tsemo region of Rebkong, eastern Tibet. Exile sources are saying that Tibetans from around the region started gathering in Tsemo upon hearing news of the self-immolation protest."},
	{"id": 23, "name": "Nyangchag Bum", "date":"November 12, 2012", "age":"20", "location":"Dowa township in Rebkong (Chinese: Tongren), Qinghai", "status":"Deceased", "lat":"103.5", "lon":"32.5", "img": "", "info": "Twenty-year old Nyangchag Bum, the oldest of three brothers in his family, self-immolated and died early in the evening of November 12 in Dowa township, Rebkong. Local people took his corpse to the monastery and prayed there. According to Tibetans in exile, “A few thousand people gathered, saying long life prayers for the Dalai Lama and chanting the Mani mantra [associated with the Dalai Lama].”"},
	{"id": 24, "name": "Nyangkar Tashi", "date":"November 12, 2012", "age":"24", "location":"Dowa township in Rebkong (Chinese: Tongren), Qinghai", "status":"Deceased", "lat":"104.5", "lon":"32", "img": "", "info": "Twenty-four year old Nyangkar Tashi set fire to himself while Tibetans were gathering to pray for a young Tibetan mother, Tamdrin Tso, who self-immolated and died on November 7 in Dowa township in Rebkong county, Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai Province (the Tibetan area of Amdo). It was after the official visit, at around 3:15 p.m. on November 12 at Kadmar Thang in Dowa, that Nyangkar Tashi set fire to himself, calling for the long life of the Dalai Lama and a free Tibet. The same sources said: “At that time, there were lot of people there who were praying and paying their respects to Tamdrin Tso and Jinpa Gyatso. People did not allow Chinese police to take Nyangkar Tashi’s remains but brought his corpse back to his village, Drotsang in Dowa.”"},
	{"id": 25, "name": "Gonpo Tsering", "date":"November 10, 2012", "age":"19", "location":"Front of a monastery in Tsoe (Chinese: Hezuo) in the Kanlho (Gannan) Tibetan Autonomous Prefecture", "status":"Deceased", "lat":"102", "lon":"35.7", "img": "", "info": "A 19-year old Tibetan who was known as one of the brightest students at his school died after self-immolating in front of a monastery in Tsoe (Chinese: Hezuo) in the Kanlho (Gannan) Tibetan Autonomous Prefecture, Gansu on Saturday (November 10). The death was quickly confirmed by the Chinese state media. Gonpo Tsering, who had married last year, called for freedom for Tibetans, the protection of the Tibetan language, and for the Dalai Lama to be brought back to Tibet. According to Tibetan sources in exile, monks gathered at the scene and tried to extinguish the flames but failed. They took his body back to his village and prayed for him there."},
	{"id": 26, "name": "Jinpa Gyatso", "date":"November 8, 2012", "age":"Unknown", "location":"Rebkong (Chinese: Tongren) in Qinghai province, the Tibetan area of Amdo", "status":"Deceased", "lat":"105.7", "lon":"32.1", "img": "", "info": "As Jinpa Gyatso set himself ablaze, he could be heard shouting for the return of the Dalai Lama to Tibet, according to a Tibetan source in exile. His body was taken by local Tibetans to an area where high lamas are cremated. According to other exile sources, following the cremation, Tibetans began to gather at the square where Jinpa had died, and some shouted slogans calling for the Dalai Lama’s long life and his return to Tibet. The situation remains tense."},
	{"id": 27, "name": "Dorjee", "date":"November 7, 2012", "age":"15", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"", "lat":"101.2", "lon":"31.7", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dorjee-03-150.jpg", "info": "Three young monks from Ngoshul monastery in Ngaba (Chinese: Aba) county in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) set themselves on fire; one died, while two were believed to have survived and to have been taken away by the authorities. According to Tibetan monks in exile from Kirti monastery, the three monks set fire to themselves at around 3 pm November 7 calling out for the Dalai Lama to return to Tibet and for a free Tibet. One of the monks, 15-year old Dorjee, died immediately while 16-year old Samdrup and 16-year old Dorjee Kyab survived and were taken away by the authorities."},
	{"id": 28, "name": "Samdrup", "date":"November 7, 2012", "age":"16", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Hospitalized", "lat":"101.4", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/samdrup-01.jpg", "info": "Three young monks from Ngoshul monastery in Ngaba (Chinese: Aba) county in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) set themselves on fire; one died, while two were believed to have survived and to have been taken away by the authorities. According to Tibetan monks in exile from Kirti monastery, the three monks set fire to themselves at around 3 pm November 7 calling out for the Dalai Lama to return to Tibet and for a free Tibet. One of the monks, 15-year old Dorjee, died immediately while 16-year old Samdrup and 16-year old Dorjee Kyab survived and were taken away by the authorities."},
	{"id": 29, "name": "Dorjee Kyab", "date":"November 7, 2012", "age":"16", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Hospitalized", "lat":"101", "lon":"32", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dorjee-Kyab-02-150.jpg", "info": "Three young monks from Ngoshul monastery in Ngaba (Chinese: Aba) county in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) set themselves on fire; one died, while two were believed to have survived and to have been taken away by the authorities. According to Tibetan monks in exile from Kirti monastery, the three monks set fire to themselves at around 3 pm November 7 calling out for the Dalai Lama to return to Tibet and for a free Tibet. One of the monks, 15-year old Dorjee, died immediately while 16-year old Samdrup and 16-year old Dorjee Kyab survived and were taken away by the authorities."},
	{"id": 30, "name": "Tamding Tso", "date":"November 7, 2012", "age":"23", "location":"Rebkong (Chinese: Tongren) in Qinghai province, the Tibetan area of Amdo", "status":"Deceased", "lat":"104.5", "lon":"33", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tamding-tso-150.jpg", "info": "Tamdrin Tso, a 23-year old mother of a six-year old boy, set herself on fire and died in the center of the Drorong Po village in Dowa township in Rebkong (Chinese: Tongren). According to Tibetans sources in exile, local Tibetans had noticed Tamdrin Tso praying for Tibetans who had self-immolated: “She said Mani mantra [mantras associated with the Dalai Lama] and took vows about fasting and not drinking. Also she prayed and offered butter lamps in the monastery. Local people said that even though Tamdrin Tso did all of these things, in the end she could not bear it. And she set fire to herself.”"},
	{"id": 31, "name": "Tsegyal", "date":"November 7, 2012", "age":"27", "location":"Bankar village, Driru County, Tibet Autonomous Region", "status":"Deceased", "lat":"91", "lon":"30", "img": "", "info": "Tsegyal, 27, was taken into police custody after he set himself on fire in Tingser Village of Bekar Township in Diru County. For less than two weeks, from 7 to 18 November, Tsegyal received no treatment for his burns while being held at the local police station in Nagchu town, sources told TCHRD. Tsegyal died in the evening of 18 November in police custody."},
	{"id": 32, "name": "Dorjee Lhundrup", "date":"November 4, 2012", "age":"Mid-twenties", "location":"Rebkong (Chinese: Tongren) in Qinghai province, the Tibetan area of Amdo", "status":"Deceased", "lat":"102.5", "lon":"33.1", "img": "", "info": "A young Tibetan man called Dorjee Lhundrup set fire to himself today in Rebkong (Chinese: Tongren) in Qinghai province, the Tibetan area of Amdo. Dorjee Lhundrup was a farmer in his mid-twenties from Chuma village in Rebkong. He had two children, a two-year old daughter and a four-year old son. Dorjee Lhundrup self-immolated on the morning of November 4 on Taglung South Street, some kilometers west of Rongwo monastery. He died immediately afterwards."},
	{"id": 33, "name": "Tsewang Kyab", "date":"October 26, 2012", "age":"Early-twenties", "location":"In Setri village in Sangkok township in Sangchu (Chinese: Xiahe) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province, in the Tibetan region of Amdo", "status":"Deceased", "lat":"35.7", "lon":"102.1", "img": "", "info": "Tsewang Kyab set fire to himself near the bus stand in Setri village in Sangkok township in Sangchu (Chinese: Xiahe) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province, in the Tibetan region of Amdo. Tsewang Kyab died, and despite an attempt by officials to intervene, local Tibetans covered up his corpse with khatags (white blessing scarves) and took him to his home."},
	{"id": 34, "name": "Lhamo Tseten", "date":"October 26, 2012", "age":"Mid-twenties", "location":"Amchok township in Sangchu (Chinese: Xiahe) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102", "lon":"35.7", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/lhamo-Tseten-150a.jpg", "info": "Lhamo Tseten self-immolated in front of the local military base and township administration in Amchok, which is in Sangchu (Chinese: Xiahe) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture in Gansu province (the Tibetan area of Amdo). He was married to a local Tibetan woman, Tsering, and they have a two year old daughter. He is the fourth Tibetan from Sangchu county to self-immolate in the past week, following the deaths of Lhamo Kyab near Bora monastery on October 20, Dhondup outside Labrang Tashikyil monastery on October 22, and Dorje Rinchen outside a military base in Labrang town on October 23."},
	{"id": 35, "name": "Tsepo", "date":"October 25, 2012", "age":"20", "location":"Near a government building in Nagchu (Chinese: Naqu), Tibet Autonomous Region", "status":"Deceased", "lat":"92", "lon":"31.4", "img": "", "info": "Two Tibetans in their twenties set fire to themselves in a double self-immolation near a government building in Nagchu (Chinese: Naqu), Tibet Autonomous Region, on Thursday, October 25. Some Tibetan sources reported that the Tibetans were cousins. Both of them were from Bankar monastery and Bankar village in Driru (Chinese: Briru) in Nagchu."},
	{"id": 36, "name": "Tenzin", "date":"October 25, 2012", "age":"25", "location":"Near a government building in Nagchu (Chinese: Naqu), Tibet Autonomous Region", "status":"Unknown", "lat":"92", "lon":"31.6", "img": "", "info": "Two Tibetans in their twenties set fire to themselves in a double self-immolation near a government building in Nagchu (Chinese: Naqu), Tibet Autonomous Region, on Thursday, October 25. Some Tibetan sources reported that the Tibetans were cousins. Both of them were from Bankar monastery and Bankar village in Driru (Chinese: Briru) in Nagchu."},
	{"id": 37, "name": "Dorje Rinchen", "date":"October 23, 2012", "age":"Late fifties", "location":"Near the military camp and in front of the Gyugya market on the main street of Labrang (Chinese: Xiahe) in Kanlho (Gannan) Tibetan Autonomous Prefecture in Gansu Province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102.5", "lon":"35.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dorje-Rinchen-150.jpg", "info": "According to Tibetans in exile, Dorje Rinchen did not die immediately but has now passed away. The same sources said that local people did not allow his body to be taken away by troops. Instead his body was taken home to his village, Sayi, which is around two kilometers east of Labrang monastery. Monks from Labrang were initially not allowed to go to his home to pray."},
	{"id": 38, "name": "Dhondup", "date":"October 22, 2012", "age":"Sixties", "location":"At the side of a temple called Serkhang in Labrang Tashikyil (Chinese: Xiahe) monastery in Kanlho (Gannan) Tibetan Autonomous Prefecture in Gansu Province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102", "lon":"34.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dundup-150.jpg", "info": "A Tibetan man called Dhondup set fire to himself this morning (October 22) at the side of a temple called Serkhang (meaning golden house or temple) in Labrang Tashikyil (Chinese: Xiahe) monastery in Kanlho (Gannan) Tibetan Autonomous Prefecture in Gansu Province (the Tibetan area of Amdo). Graphic images that reached Tibetans in exile depict his burning body near the pilgrimage circuit of the monastery, and one photograph shows a khatag (white blessing scarf) placed at the spot after his body was removed. According to reports from exile Tibetans, Dhondup died after his self-immolation and troops took away his body. A Tibetan in exile from Labrang told ICT: “We heard that the flames surrounding the body were so intense. Troops arrived soon afterwards and put the remains in a large bag and took it away. Local monks then tried to hold prayers for Dhondup but police and monastic officials tried to prevent this happening.”"},
	{"id": 39, "name": "Lhamo Kyab", "date":"October 20, 2012", "age":"Late twenties", "location":"Near Bora monastery in Sangchu (Chinese: Xiahe) county, Kanlho (Gannan) prefecture in Gansu province", "status":"Deceased", "lat":"101.5", "lon":"35", "img": "", "info": "A Tibetan in his late twenties called Lhamo Kyab set fire to himself and died today near Bora monastery in Sangchu (Chinese: Xiahe) county, Kanlho (Gannan) prefecture in Gansu province. Lhamo Kyab leaves a wife and two children, aged 10 and 7. According to Tibetans in exile, Lhamo Kyab was seen running along the road in flames, and calling for the Dalai Lama to come home to Tibet. The same sources said that police tried to put out the flames, and a local man took off his shirt and tried to fling it over Lhamo Kyab but the blaze was too strong."},
	{"id": 40, "name": "Tamdin Dorje", "date":"October 13, 2012", "age":"Early fifties", "location":"Near a white stupa beside Tsoe Gaden Choeling monastery in Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo)", "status":"Deceased", "lat":"101.8", "lon":"34.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tamdin-Dorje-02-150.jpg", "info": "Tamdin Dorje, the grandfather of a prominent young Tibetan reincarnate lama at Labrang Tashikyil monastery, died after setting fire to himself in the same place as mother of two Dolkar Tso, who self-immolated on August 7, near a white stupa beside Tsoe Gaden Choeling monastery in Kanlho Tibetan Autonomous Prefecture, Gansu province (see ICT report, 7 August 2012). The self-immolation is likely to be noted with concern by the authorities due to the connection to the young lama recognised as the 7th Gungthang Rinpoche, Lobsang Geleg Tenpe Khenchen, who was born in 2002 in the village of Dzoege, east of Tsoe city, the seat of Kanlho Tibetan Autonomous Prefecture in the southern part of Gansu Province. Tamdin Dorje was the father of the young lama’s mother."},
	{"id": 41, "name": "Sangay Gyatso", "date":"October 6, 2012", "age":"27", "location":"Tsoe, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo)", "status":"Deceased", "lat":"102.6", "lon":"34.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/sangay-gyatso-150.jpg", "info": "According to a report by Voice of America, Sangay Gyatso, 27-years old, set fire to himself on October 6, 2012 near the local monastery in the town of Tsoe in the northeastern Tibetan area of Amdo. Sangay Gyatso called for the return of the Dalai Lama to Tibet and the right of Tibetans to freely express their language and religion. He is believed to have died as a result of his protest. Initial reports from the area tell of heightened tensions in the area and possibly hundreds of security personnel being deployed around the local monastery."},
	{"id": 42, "name": "Gudrub", "date":"October 4, 2012", "age":"43", "location":"Nagchu county, Nagchu prefecture, Tibet Autonomous Region", "status":"Deceased", "lat":"93", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/gudrub.jpg", "info": "Gudrub, a 43-year old writer from neighboring Driru county, set fire to himself and called for freedom in Tibet and for the return of the Dalai Lama. VOA reported that a group of Tibetans transported Gudrub’s body to hospital, where authorities took him into their custody. A doctor later told the group that Gudrub had died, but authorities would not release his body."},
	{"id": 43, "name": "Yangdang", "date":"September 29, 2012", "age":"27", "location":"Dzatoe County, Yulshul Tibetan Autonomous Prefecture, Qinghai province", "status":"Deceased", "lat":"97", "lon":"33.2", "img": "", "info": "According to Tibetans in exile in contact with Tibetans in the area, Yangdang set fire to himself along the main road in Dzato county town at around 7 pm, and shouted slogans calling for freedom in Tibet and for the return of the Dalai Lama and the Karmapa (a prominent Tibetan lama). After onlookers, including local Chinese shop owners, were able to put out the flames with buckets of water, security forces cordoned off the area and took Yangdang’s body to the local hospital. The following day local authorities informed family members that Yangdang would be transferred to a hospital outside the Tibetan area due to his serious condition. However, local authorities later informed family members that Yangdang died while in transport. Authorities have yet to release Yangdang’s body to his family, according to the same sources."},
	{"id": 44, "name": "Passang Lhamo", "date":"September 13, 2012", "age":"62", "location":"Beijing", "status":"Unknown, survived self-immolation", "lat":"", "lon":"", "img": "", "info": "On September 13, 2012 Passang Lhamo from Kyegudo (Chinese: Yushu) in Qinghai, set fire to herself in Beijing, according to Tibetan sources. Passang Lhamo travelled to Beijing to appeal to the central government after local authorities refused toallow her to retain her home. An image from the area depicts her home in the process of destruction, according to Tibetan sources from the area. News of Passang Lhamo’s self-immolation only emerged recently due to security restrictions. According to the Tibetan government in exile (Land Grabbing Persists in Kyegudo, A Tibetan Woman Burned Self in Protest), Passang Lhamo set fire to herself after repeated appeals to the central authorities in Beijing failed to yield any concrete results. The 62-year old was taken to hospital and treated for her burns following her protest, according to the same sources. No more is known about her current condition or whereabouts."},
	{"id": 45, "name": "Lobsang Damchoe", "date":"August 27, 2012", "age":"17", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"104.3", "lon":"31.3", "img": "", "info": "Two teenage Tibetans, a monk and a layperson who are believed to have been cousins, set themselves on fire on August 27 in Ngaba (Chinese: Aba). The self-immolations took place near the eastern gate of Kirti monastery. Lobsang Damchoe, 17, a former monk, was seen walking with flames shooting from his body before he collapsed to the ground, according to Kirti monks in exile in Dharamsala, India. It is not known what he shouted or said as he set himself on fire. Chinese security personnel extinguished the flames and took both men initially to the hospital in Ngaba town, but later moved them to a hospital in Barkham. According to the Kirti monks in exile, both young men died in hospital."},
	{"id": 46, "name": "Lobsang Kelsang", "date":"August 27, 2012", "age":"18", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"104.3", "lon":"31.1", "img": "", "info": "Two teenage Tibetans, a monk and a layperson who are believed to have been cousins, set themselves on fire on August 27 in Ngaba (Chinese: Aba). The self-immolations took place near the eastern gate of Kirti monastery. Lobsang Damchoe, 17, a former monk, was seen walking with flames shooting from his body before he collapsed to the ground, according to Kirti monks in exile in Dharamsala, India. It is not known what he shouted or said as he set himself on fire. Chinese security personnel extinguished the flames and took both men initially to the hospital in Ngaba town, but later moved them to a hospital in Barkham. According to the Kirti monks in exile, both young men died in hospital."},
	{"id": 47, "name": "Lungtok", "date":"August 13, 2012", "age":"20", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"104.5", "lon":"31", "img": "", "info": "At around 6:50pm on August 13th, a 21 year old layman named Tashi from the Soruma pastoral area in Choejema township, and the monk Lungtok, aged about 20, also from Soruma and a student in Kirti monastery’s medical college, set fire to themselves in a prayer wheel enclosure on the monastery’s perimeter, and then emerged shouting protest slogans onto the ‘Heroes’ road’ leading into town from the monastery. As Lungtok approached the junction with the central street, a group of policemen surrounded him, put out the flames and took him away. It is unclear whether he was still alive at that time. Both were taken initially to the county hospital, and then within half an hour they were taken to the Prefecture hospital in Barkham, but according to witnesses, their burns were so severe that there is little hope of survival."},
	{"id": 48, "name": "Tashi", "date":"August 13, 2012", "age":"21", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"104.6", "lon":"31.1", "img": "", "info": "At around 6:50pm on August 13th, a 21 year old layman named Tashi from the Soruma pastoral area in Choejema township, and the monk Lungtok, aged about 20, also from Soruma and a student in Kirti monastery’s medical college, set fire to themselves in a prayer wheel enclosure on the monastery’s perimeter, and then emerged shouting protest slogans onto the ‘Heroes’ road’ leading into town from the monastery. As Lungtok approached the junction with the central street, a group of policemen surrounded him, put out the flames and took him away. It is unclear whether he was still alive at that time. Both were taken initially to the county hospital, and then within half an hour they were taken to the Prefecture hospital in Barkham, but according to witnesses, their burns were so severe that there is little hope of survival. It has been learned that Lungtok passed away on 13th, but as he had been taken to Barkham, it is not known whether his body would be returned to family members."},
	{"id": 49, "name": "Chopa", "date":"August 10, 2012", "age":"24", "location":"Me’uruma township, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"105", "lon":"32", "img": "", "info": "On August 10 at about 10:15 am, 24 year old Chopa set himself on fire in Me’uruma township, Ngaba county, shouting slogans of protest against the Chinese government. Within a few minutes, local security forces arrived at the scene, doused the still fierce flames, and took him away. According to witnesses, it was not clear at that point whether he was still alive. It has since been confirmed that Chopa passed away just after 3pm on August 10, shortly before reaching Barkham prefecture hospital. The authorities cremated his body there, and returned just a part of the ashes to his family members."},
	{"id": 50, "name": "Dolkar Tso", "date":"August 7, 2012", "age":"Twenties", "location":"Near Tsoe Gaden Choeling monastery in Kanlho (Chinese: Gannan Tibetan Autonomous Prefecture) in Gansu Province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"", "lon":"", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dolkar-Kyi-150.jpg", "info": "Dolkar Tso, who is in her mid-twenties and from a farming family, set fire to herself early this afternoon near a white stupa (reliquary building) at Tsoe Gaden Choeling monastery in Tsoe City (Chinese: Hezuo). According to Tibetan sources in exile from her home area, she called out for the return of the Dalai Lama to Tibet, and shouted that there was no freedom in Tibet."},
	{"id": 51, "name": "Lobsang Tsultrim", "date":"August 6, 2012", "age":"21", "location":"Ngaba (Chinese: Aba) town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo)", "status":"Deceased", "lat":"106", "lon":"32", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Lobsang-Tsultrim-0807-150.jpg", "info": "According to the exile Kirti monks, Lobsang Tsultrim attempted to walk along the main street towards the office building of the Forestry Department before he fell to the ground, and armed police emerged and extinguished the flames. A local Tibetan told the Kirti monks in Dharamsala that Lobsang Tsultrim was still alive when police took him away. He is believed to have been taken to the local government hospital, and then removed elsewhere. His current whereabouts and welfare is not known. Lobsang Tsultrim was born in Ryiwa village, Cha Township in Ngaba, and he joined Kirti monastery when he was very young. He was a classmate of Phuntsog, who self-immolated on March 16, 2011, and is said to have loved playing basketball. Lobsang Tsultrim is said to have suffered a great deal and may have been detained following the crackdown in Ngaba from March 16, 2008, when at least ten Tibetans were killed by Chinese troops after peaceful protest. He is the 27th Tibetan from Ngaba to self-immolate since February, 2009, and the eighth Kirti monk to do so."},
	{"id": 52, "name": "Losang Lozin", "date":"July 17, 2012", "age":"18", "location":"North of Barkham county, Sichuan province", "status":"Deceased", "lat":"104.5", "lon":"32", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Losang-Lozin.jpg", "info": "The self-immolation and death today of an 18-year old Tibetan monk from Ngaba is being marked by Tibetans at his monastery, Gedhen Tashi Choeling, an affiliate of Kirti monastery. Losang Lozin set fire to himself in front of the monastery’s main assembly hall today and then attempted to start walking towards the township government office, according to monks from Kirti monastery in Dharamsala, India."},
	{"id": 53, "name": "Tsewang Dorjee", "date":"July 7, 2012", "age":"22", "location":"Damshung, Tibet Autonomous Region", "status":"Deceased", "lat":"91", "lon":"30.4", "img": "", "info": "The Tibetan man who set himself on fire on July 7 has now been identified as Tsewang Dorjee, a 22-year-old nomad from Damshung, central Tibet. Tsewang Dorjee raised slogans and called for the long life of His Holiness, but barely three minutes into his protest, Chinese security forces arrived at the scene, doused the flames and took him to a hospital. In a press release, the Tibetan Parliament-in-exile noted that the entire Damshung region is currently under lockdown and people who witnessed the self-immolation have since been arrested."},
	{"id": 54, "name": "Dickyi Choezom", "date":"June 27, 2012", "age":"Forties", "location":"Kyegudo", "status":"Unknown", "lat":"96.9", "lon":"33", "img": "", "info": "A Tibetan woman in her 40s, identified as Dickyi Choezom, a mother of two, set herself on fire on June 27, at around 2pm (local time) in Keygu town near the Dhondupling Monastery. Chinese security personnel at the scene of the protest doused the flames and took her away, reportedly to a hospital in Siling, but no further information is available. An exile monk with contacts in the region told Tibetan media that police arrested two of her relatives but many Tibetans gathered and started demanding their release and threatening to set themselves on fire if the two were not released, and they were reportedly released later in the day but carried injuries from severe beatings. Tibetans from Kyegudo have been protesting China’s redevelopment plans in the region following the devastating earthquake in April 2010."},
	{"id": 55, "name": "Ngawang Norphel", "date":"June 20, 2012", "age":"22", "location":"Trindu, Qinghai province", "status":"Believed to have died on July 30", "lat":"93.9", "lon":"33", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/ngawang-norphel-150.jpg", "info": "Carrying Tibetan flags and shouting pro-independence slogans, former monk Tenzin Khedup, 24, and Ngawang Norphel, 22, torched themselves in Dzatoe (in Chinese, Zaduo) township, Tridu (Chenduo) county, in the Yulshul (Yushu) Tibetan Autonomous Prefecture, the exile sources said. Tenzin Khedup died on the spot while his colleague, Ngawang Norphel was badly burned and is in serious condition at a hospital, according to Lobsang Sangay, a monk in India who is from the Zekar monastery in Yushul, quoting eyewitnesses."},
	{"id": 56, "name": "Tenzin Khedup", "date":"June 20, 2012", "age":"24", "location":"Trindu, Qinghai province", "status":"Deceased", "lat":"93.8", "lon":"33.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tenzin-khedup-150.jpg", "info": "Carrying Tibetan flags and shouting pro-independence slogans, former monk Tenzin Khedup, 24, and Ngawang Norphel, 22, torched themselves in Dzatoe (in Chinese, Zaduo) township, Tridu (Chenduo) county, in the Yulshul (Yushu) Tibetan Autonomous Prefecture, the exile sources said. Tenzin Khedup died on the spot while his colleague, Ngawang Norphel was badly burned and is in serious condition at a hospital, according to Lobsang Sangay, a monk in India who is from the Zekar monastery in Yushul, quoting eyewitnesses."},
	{"id": 57, "name": "Tamdin Thar", "date":"June 15, 2012", "age":"Fifties", "location":"Chentsa (Chinese: Jianza) county town in Qinghai (the eastern Tibetan area of Amdo)", "status":"Deceased", "lat":"93.5", "lon":"29.8", "img": "", "info": "Tibetans in eastern Tibet gathered today to mark the self-immolation of a Tibetan from a nomadic family who set fire to himself and died in Chentsa (Chinese: Jianza) county town in Qinghai (the eastern Tibetan area of Amdo). Images posted online by Tibetans in exile showed crowds gathering to pile khatags (Tibetan blessing scarves) on the body of Tamdin Thar, who was in his forties or fifties, while massed ranks of armed police gather at the roadside nearby. Tamdin Thar set himself on fire early this morning in front of the People’s Armed Police base in Chentsa, Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture, according to Tibetan sources in exile. Armed police were seen extinguishing the flames as Tamdin Thar lay on the ground, still moving slightly, and he was then taken away in a vehicle by security forces. According to Tibetan sources in exile in touch with Tibetans in the area, he died within hours, and local people gathered in the town calling for the return of his body, despite an increasing number of armed police being deployed."},
	{"id": 58, "name": "Rikyo", "date":"May 30, 2012", "age":"33", "location":"Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"100.9", "lon":"32.1", "img": "", "info": "Rikyo was in her mid-thirties and from a nomadic family. She set herself on fire near to Jonang Dzamthang Gonchen Monastery. The flames around her body were so intense that police on the scene were beaten back by the fire and attempts to extinguish it failed. Following her self-immolation, her body was taken to the Jonang Dzamthang Monastery and kept there, according to Tibetans in exile who are from the area. Chinese government officials came to the monastery and sought to impose an immediate cremation. Rikyo was cremated the same day, and a large number of Tibetans converged at a special cremation prayer service near the monastery. According to a Tibetan in exile in contact with Tibetans from Dzamthang, “Although it was raining and a heavy storm, people did not move from the cremation area near the monastery until around 3 a.m.”"},
	{"id": 59, "name": "Dargye", "date":"May 27, 2012", "age":"25", "location":"Outside of the Jokhang Temple in Lhasa, Tibet Autonomous Region", "status":"Deceased", "lat":"91.1", "lon":"29.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/dargye-150.jpg", "info": "Two young Tibetan men set fire to themselves on May 27 outside one of Tibet’s holiest shrines, the Jokhang Temple, in the first self-immolation in Lhasa, Tibet’s historic capital. According to monks from Kirti Monastery in exile, 25-year old Dargye had entered Kirti monastery as a boy and disrobed a few years ago. Voice of America Tibetan language service has reported that the two Tibetans, who self-immolated together, worked in a restaurant in Lhasa. Dargye was reportedly from Ngaba (Chinese: Aba) in Sichuan (where most of the self-immolations have taken place). The self-immolations took place during Saga Dawa, an important religious period for Tibetan Buddhists that commemorates the Buddha’s birth, enlightenment and death. The self-immolations are the first in Lhasa where Chinese security has been tight since March 2008 when protests occurred across Tibet and rocked the capital city. The official media reported today that Lhasa’s Public Security Bureau has set up a special task force to investigate the case."},
	{"id": 60, "name": "Dorje Tseten", "date":"May 27, 2012", "age":"19", "location":"Outside of the Jokhang Temple in Lhasa, Tibet Autonomous Region", "status":"Deceased", "lat":"91", "lon":"29.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tobgye-tseten-150.jpg", "info": "Two young Tibetan men set fire to themselves on May 27 outside one of Tibet’s holiest shrines, the Jokhang Temple, in the first self-immolation in Lhasa, Tibet’s historic capital. Nineteen-year old Dorje Tseten had left home after high school and had been renting a room in a house in Lhasa. The entire household was detained soon after his self-immolation. Voice of America Tibetan language service has reported that the two Tibetans, who self-immolated together, worked in a restaurant in Lhasa. Dorje Tseten was reportedly from Labrang (Chinese: Xiahe) in Gansu, the Tibetan area of Amdo. The self-immolations took place during Saga Dawa, an important religious period for Tibetan Buddhists that commemorates the Buddha’s birth, enlightenment and death. The self-immolations are the first in Lhasa where Chinese security has been tight since March 2008 when protests occurred across Tibet and rocked the capital city. The official media reported today that Lhasa’s Public Security Bureau has set up a special task force to investigate the case. Dorje Tseten is referred to in Xinhua sources as Tobgye Tseten."},
	{"id": 61, "name": "Choepak Kyap", "date":"April 19, 2012", "age":"Twenties", "location":"Close to a local government office in Barma township near Jonang Dzamthang Gonchen monastery in the Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"101", "lon":"32", "img": "", "info": "Two Tibetan men in their twenties set fire to themselves today close to a local government office in Barma township near Jonang Dzamthang Gonchen monastery in the Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan. The two Tibetans who self-immolated today were named by two exile Tibetan sources as Choepak Kyap and Sonam. Although paramilitary troops were deployed immediately, local people managed to prevent them from taking away the bodies of the two Tibetans, who had died following the self-immolation, according to the same two sources. According to the exile Tibetans, who are in contact with Tibetans in the area, the bodies were taken to the monastery in order to carry out prayers, and many other Tibetans are gathering there. It is expected that a cremation and funeral services will be held soon."},
	{"id": 62, "name": "Sonam", "date":"April 19, 2012", "age":"Twenties", "location":"Close to a local government office in Barma township near Jonang Dzamthang Gonchen monastery in the Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"101.4", "lon":"32", "img": "", "info": "Two Tibetan men in their twenties set fire to themselves today close to a local government office in Barma township near Jonang Dzamthang Gonchen monastery in the Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan. The two Tibetans who self-immolated today were named by two exile Tibetan sources as Choepak Kyap and Sonam. Although paramilitary troops were deployed immediately, local people managed to prevent them from taking away the bodies of the two Tibetans, who had died following the self-immolation, according to the same two sources. According to the exile Tibetans, who are in contact with Tibetans in the area, the bodies were taken to the monastery in order to carry out prayers, and many other Tibetans are gathering there. It is expected that a cremation and funeral services will be held soon."},
	{"id": 63, "name": "Thubten Nyandak Rinpoche and his niece Atse", "date":"April 6, 2012", "age":"45 and 23", "location":"", "status":"Both deceased, full circumstances of their deaths remain unclear", "lat":"101.9", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/april-6.jpg", "info": "Circumstances around the deaths of a Tibetan religious figure and his niece in Kardze who died in a fire remain unclear. Thubten Nyandak, 45, and his niece Atse, 23 died on April 6, 2012, in their residence at a monastery. New information from the Central Tibetan Administration (CTA) in Dharamsala, India, indicates that their deaths were due to self-immolation. Tibetan writer Woeser also states that this was a case of self-immolation. The CTA in Dharamsala reported: “On the day of his immolation, he told his family on phone: ‘Today I feel at ease and ending my life by offering butter lamps for all those Tibetans who have set themselves on fire for the cause of Tibet’. Immediately after making the call, he and his niece set themselves on fire.”"},
	{"id": 64, "name": "Chimey Palden", "date":"March 30, 2012", "age":"21", "location":"Barkham (Chinese: Ma’erkang), Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan (Tibetan area of Amdo)", "status":"Deceased", "lat":"90", "lon":"30.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/chimey-palden-150.jpg", "info": "Chimey Palden, a 21-year old monk from Tsodun monastery in Ngaba, set fire to himself, along with fellow monk Tenpa Darjey, aged 22, on March 30, 2012 outside the prefectureal government offices in Barkham, Ngaba. The area is now under lockdown by armed troops and no further information is known about the two monks’ survival or current whereabouts, according to the Kirti monks in exile. Chimey Palden went to Kirti monastery in Ngaba as a philosophy student in 2009, but stayed only a few months. In 2010, on a visit to Lhasa, he was searched by Public Security personnel, who found a photo of the Dalai Lama, a picture of the Tibetan national flag and a Tibetan song on his mobile phone. He was detained for more than a month."},
	{"id": 65, "name": "Tenpa Darjey", "date":"March 30, 2012", "age":"22", "location":"Barkham (Chinese: Ma’erkang), Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan (Tibetan area of Amdo)", "status":"Deceased", "lat":"90.3", "lon":"30.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tenpa-darjey-150.jpg", "info": "Tenpa Darjey, a 22-year old monk from Tsodun monastery in Ngaba, set fire to himself, along with fellow monk Chimey Palden, aged 21, on March 30, 2012 outside the prefectureal government offices in Barkham, Ngaba. The area is now under lockdown by armed troops and no further information is known about the two monks’ survival or current whereabouts, according to the Kirti monks in exile. Tenpa Darjey studied philosophy at Kirti monastery in Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan, from 2003-2009. He then returned to Tsodun where he was regarded as one of the best students in the logic and debating class. He was the youngest of four brothers and sisters."},
	{"id": 66, "name": "Lobsang Sherab", "date":"March 28, 2012", "age":"20", "location":"Cha township, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"90.1", "lon":"30", "img": "", "info": "Lobsang Sherab was a 20-year old monk at Ganden Tenpeling monastery in Rasuwa, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province (Tibetan area of Amdo). According to monks from Kirti monastery now living in exile in Dharamsala, India, paramilitary police in Ngaba removed Sherab’s body immediately following his self-immolation, ignoring pleas for his body to be handed over to his family. Sherab had been a monk at the small Ganden Tenpeling monastery in Raruwa since the age of nine. Last October he went to study at Kirti monastery in Ngaba, but had returned home on March 26, 2012. According to a Kirti monk in exile, “These days some 300 Chinese government officials of various positions and rank are stationed at Kirti monastery, and throughout Ngaba armed police and special police forces maintain a security clampdown.”"},
	{"id": 67, "name": "Sonam Dargye", "date":"March 17, 2012", "age":"44", "location":"Northeastern Qinghai province", "status":"Deceased", "lat":"96.9", "lon":"30.7", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Sonam-Dargye-150.png", "info": "Sonam Dargye, a 44-year old father of three from the town of Rongpo, is the second Tibetan in the Rebkong area to set fire to himself. Images and footage that emerged almost immediately from Tibet shows thousands of Tibetans in Rebkong (Chinese: Tongren), Malho (Chinese: Huangnan) Tibetan Auonomous Prefecture, Qinghai (Tibetan area of Amdo) gathering to mark the passing of Sonam Dargye, a Tibetan farmer who died after self-immolating near the center of Rongpo town on Saturday (March 17) (VOA, 19 March 2012). A video released by VOA and shared by Tibetans on Facebook shows the body of Sonam Dargye still aflame in the middle of the street in Rongpo town, as hundreds of Tibetans gather around."},
	{"id": 68, "name": "Lobsang Tsultrim", "date":"March 16, 2012", "age":"20", "location":"Ngaba county town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102.2", "lon":"31.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Lobsang-Tsultrim-150.jpg", "info": "Lobsang Tsultrim set himself on fire and proceeded to march along the main road in the upper part of Ngaba county town, shouting slogans of protest against the Chinese government. As he walked on from the site of his self-immolation, armed police personnel came running to intercept him, at which he turned and ran back in the other direction, continuing to shout. He was then knocked to the ground by a police officer, and the police extinguished the flames, and threw him into the back of a pickup vehicle. He was held down by police officers, but was seen to raise his arms while continuing to shout, showing that he was still alive. Lobsang Tsultrim was from the Yeshe Tsang household in Soruma village, Choejema township, Ngaba county. His father’s name is Yeshe and his mother is Tsedron. He was the eldest of four brothers and sisters. He joined Kirti monastery at the age of eight, and studied at the ‘Buddhist youth academy’ or monastery school. Once that institution was closed down in 2003, he entered the monastery’s Tantric college."},
	{"id": 69, "name": "Jamyang Palden", "date":"March 14, 2012", "age":"Thirties", "location":"Rebkong, Qinghai", "status":"Deceased", "lat":"101.9", "lon":"35.4", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/jamyang-palden-150.jpg", "info": "Jamyang Palden, a monk in his thirties from Rongpo monastery in Rebkong (Chinese: Tongren), Qinghai (the Tibetan area of Amdo), set fire to himself this morning. It is the first self-immolation in Rebkong, and the 28th in Tibet since February, 2009. Jamyang Palden survived the self-immolation, but his condition is serious, according to Tibetans in exile in contact with those in the area. Jamyang Palden set fire to himself in Dolma square, near Rongpo monastery, which is the main monastery in Rebkong. Monks and local people took him to hospital, but it seems that he has since been moved back to the monastery. Despite the buildup of troops, images from Rebkong today show local people gathered at the scene of his self-immolation, quietly praying for him. The gathering led to a peaceful protest, with Tibetans calling for the Dalai Lama to return to Tibet. There are fears for the safety of Tibetans in Rebkong due to the military buildup following the self-immolation."},
	{"id": 70, "name": "Gepey", "date":"March 10, 2012", "age":"18", "location":"Near a Chinese military camp location 1.5 kilometers from Kirti monastery in Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"102.3", "lon":"31.7", "img": "", "info": "“Chinese authorities took Gepey’s body and forced cremation of his body the same night, according to UK-based advocacy group Free Tibet. Lobsang Yeshi, spokesperson of Kirti monastery in India told VOA Tibetan that Gepey is survived by his mother and two brothers, who are also monks at the Kirti monastery in Ngaba.”"},
	{"id": 71, "name": "Dorjee", "date":"March 5, 2012", "age":"18", "location":"Cha (Chinese: Jia) township, Ngaba (Chinese: Aba) county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province", "status":"Deceased", "lat":"90.2", "lon":"29.9", "img": "", "info": "An 18-year old male named Dorjee set fire to himself today at around 6:30 p.m. local time and walked towards the local government office in Cha (Chinese: Jia) township, Ngaba (Chinese: Aba) county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province. According to the same sources, Kirti monks in contact with Tibetans in the region, Dorjee shouted slogans against the Chinese government’s policies on Tibet. It is believed that he died at the scene, and that authorities took away his body."},
	{"id": 72, "name": "Rinchen", "date":"March 4, 2012", "age":"Early thirties", "location":"Near a military camp in the vicinity of Kirti monastery in Ngaba (Chinese: Aba) town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102.4", "lon":"31.8", "img": "", "info": "A Tibetan mother named Rinchen self-immolated near a military camp in the vicinity of Kirti monastery in Ngaba (Chinese: Aba) town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo). Rinchen was in her early thirties, and was married to a Tibetan man who had died (details of when he died and the circumstances are not clear). It could not be immediately confirmed whether she had three or four children; the youngest was several months old, and the oldest in their early teens. According to Tibetan monks from Kirti who are now in exile, as she set herself ablaze, Rinchen shouted “Return His Holiness to Tibet” and “We need freedom”. She died soon afterwards, according to the same sources. Rinchen was the eldest of eight siblings in her family, from Jiashang township in Ngaba."},
	{"id": 73, "name": "Tsering Kyi", "date":"March 3, 2012", "age":"19", "location":"Machu town (Chinese: Maqu) in Kanlho (Chinese: Gannan Tibetan Autonomous Prefecture), Gansu", "status":"Deceased", "lat":"102", "lon":"33.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tsering-Kyi-150.jpg", "info": "Teenager Tsering Kyi, a pupil at the Tibetan Middle School in Machu who was aged 19, set fire to herself on Saturday afternoon (March 3) in the vegetable market of Machu town (Chinese: Maqu) in Kanlho (Chinese: Gannan Tibetan Autonomous Prefecture), Gansu. Authorities have blockaded the school Tsering Kyi attended in Machu (Chinese: Maqu) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo), and have imposed a tight military lockdown in the area following the incident, with people’s cellphones being investigated in an attempt to prevent dissemination of any images or footage that may have been taken of the self-immolation."},
	{"id": 74, "name": "Nangdrol", "date":"February 19, 2012", "age":"18", "location":"Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"101.5", "lon":"32", "img": "", "info": "Nangdrol was the fourth of eight children, and is from Choeje village, Barma township, Dzamthang, the Tibetan area of Amdo. The same sources reported that he died, and his body was taken back to the monastery where traditional Buddhist rituals were carried out for him. According to the same sources, monks did not comply with police orders to hand over the body, and this evening (February 19), more than 1000 people had gathered to hold vigil. It has been confirmed that 18-year old Nangdrol, who set himself on fire on February 19 in Dzamthang, Sichuan, was a layperson and not a monk as previously reported, according to Tibetan sources. According to Tibetans in the area who are in contact with Tibetans in exile, Nangdrol cared passionately about Tibetan culture and language and had urged fellow Tibetans to be united, and to preserve their cultural and religious identity."},
	{"id": 75, "name": "Damchoe Sangpo", "date":"February 17, 2012", "age":"38", "location":"Themchen county town, Themchen county, Tsonub Mongolian and Tibetan Autonomous Prefecture, Qinghai province", "status":"Deceased", "lat":"90.8", "lon":"38.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Damchoe-150.jpg", "info": "For the first time, a monastic official self-immolated on Friday (February 17) in Themchen (Chinese: Tianjun) county in Tsonub (Chinese: Haixi ) Mongolian and Tibetan Autonomous Prefecture, Qinghai province. Thirty-eight year old Tibetan monk Damchoe Sangpo was a member of Bongthak monastery’s Democratic Management Committee, the government-established body that runs the monastery, according to Tibetan exile sources. Voice of America Tibetan Service, which published a picture of Damchoe Sangpo here, reported that he died after setting himself ablaze after monks were banned from marking a religious ceremony, while other sources reported that he had objected to a rigorous “patriotic education” campaign at his monastery."},
	{"id": 76, "name": "Lobsang Gyatso", "date":"February 13, 2012", "age":"19", "location":"Ngaba", "status":"Unknown", "lat":"90.3", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Lobsang-Gyatso-150.jpg", "info": "At about 2:30pm on February 13th, Kirti monk Lobsang Gyatso, age 19, of the Badzritsang house in Naktsangma of Cha township, set himself on fire at the top of the main street of Ngaba town shouting slogans ofprotest against the Chinese government. In the same moment, armed police and special police officers came and extinguished the fire and took him away while beating him. His present condition and whereabouts are not known."},
	{"id": 77, "name": "Tenzin Choedron", "date":"February 11, 2012", "age":"18", "location":"Ngaba", "status":"Deceased", "lat":"102.2", "lon":"31.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tenzin-Choedron-150.jpg", "info": "Tenzin Choedron set herself on fire early in the evening on February 11, shouting slogans against the Chinese government, according to monks from Kirti monastery in exile (sister monastery to Kirti in Ngaba). She chose the same place as nun Tenzin Wangmo, the Sumdo bridge area below the nunnery, which is around three kilometers from Ngaba county town (Tibetan nun dies following self-immolation protest). Tenzin Choedron did not die immediately, but was taken away by soldiers and police. According to new information today, she died soon afterwards and her funeral ceremony is being arranged."},
	{"id": 78, "name": "Sonam Rabyang", "date":"February 8, 2012", "age":"Mid thirties", "location":"Triwang (Chinese: Chen wen) Town, the Capital of Tridu County", "status":"Taken to a hospital; condition is unclear", "lat":"93.8", "lon":"33.1", "img": "", "info": "Sonam Rabyang was a monk from Yuthung village, Lab township, Tridu (Chi: Chenduo) County, Yulshul (Chi: Yu shu) in Yulshul Tibetan Autonomous Prefecture in Qinghai Province (the Tibetan area of Kham). He was at Lab monastery, and set fire to himsef in Tridu town. It is thought that he survived, but it is not clear."},
	{"id": 79, "name": "Rinzin Dorje", "date":"February 8, 2012", "age":"19", "location":"Ngaba county town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province (the Tibetan area of Amdo)", "status":"Deceased", "lat":"101.3", "lon":"32.1", "img": "", "info": "According to two Tibetan monks from Kirti monastery in Dharamsala, India (associated with Kirti monastery in Ngaba), the Tibetan set himself on fire at a primary school early in the evening in Ngaba county town in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province (the Tibetan area of Amdo). Sources said that the Tibetan seemed to be a monk, but his name and place of origin are not known. He was taken away by police, and it is not known whether he is still alive. Two monks were also detained from the vicinity."},
	{"id": 80, "name": "Losang Jamyang", "date":"January 14, 2012", "age":"Twenties", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"31.7", "lon":"102.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Losang-Jamyang-150.jpg", "info": "According to exiled Tibetan sources, at around 1:30 pm he doused himself in petrol and set himself on fire. He walked into the street calling for the long life of the Dalai Lama and for freedom in Tibet, according to the same sources.Police began to kick and beat him with clubs spiked with nails rather than immediately focusing on putting out the flames. According to two Kirti monks in Dharamsala, India, who have spoken to several individuals in the area: “Unable to bear this sight, local Tibetans on the scene stood up to the armed security personnel without regard for their own lives, and shouting that the body should be handed over to them, tried their best to block their path as they tried to take him away.” Losang Jamyang died after his self-immolation but reports about the time of his death differ. He was taken away by police, and one of the most reliable reports suggest that he may have survived until Monday (January 16) when he died."},
	{"id": 81, "name": "Sonam Wangyal", "date":"January 8, 2012", "age":"Forties", "location":"Darlag county, Golog Tibetan Autonomous Prefecture, Qinghai province", "status":"Deceased", "lat":"99.3", "lon":"34.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Sonam-Wangyal-150a.jpg", "info": "Sonam Wangyal (also referred to as Lama Sobha), a respected religious figure in his local area, drank kerosene and set himself on fire on January 8 early in the morning in Darlag county, Golog (Chinese: Guoluo) Tibetan Autonomous Prefecture, Qinghai (the Tibetan area of Amdo), according to the Tibetan government in exile. His self-immolation was said to be linked to lack of religious freedoms in the area. Radio Free Asia reported that before he set himself ablaze, he climbed a local hill to burn incense and pray before distributing leaflets saying he would act “not for his personal glory but for Tibet and the happiness of Tibetans.”"},
	{"id": 82, "name": "Tsultrim", "date":"January 6, 2012", "age":"Around twenty", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.4", "lon":"32", "img": "", "info": "According to information from exiled Tibetan sources, two Tibetans, both aged around 20, called Tsultrim and Tennyi, set themselves on fire in the courtyard of a hotel in the center of Ngaba town, and ran into the street shouting “His Holiness the Dalai Lama must return to Tibet” and “May His Holiness the Dalai Lama live for 10,000 years!” Tennyi died on the same day, and Tsultrim died on January 7, according to the same sources."},
	{"id": 83, "name": "Tennyi", "date":"January 6, 2012", "age":"20", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.5", "lon":"32", "img": "", "info": "According to information from exiled Tibetan sources, two Tibetans, both aged around 20, called Tsultrim and Tennyi, set themselves on fire in the courtyard of a hotel in the center of Ngaba town, and ran into the street shouting “His Holiness the Dalai Lama must return to Tibet” and “May His Holiness the Dalai Lama live for 10,000 years!” Tennyi died on the same day, and Tsultrim died on January 7, according to the same sources."}

	]},
		{
		"year": "2011",
		"incidents":[
	{"id": 0, "name": "Tenzin Phuntsog", "date":"December 1, 2011", "age":"Forties", "location":"Chamdo (Chinese: Changdu or Qamdo) prefecture in the Tibet Autonomous Region", "status":"December", "lat":"104", "lon":"30.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tenzin-Phuntsog-150a.jpg", "info": "This the first self-immolation to occur in the Tibet Autonomous Region, and the 13th since Kirti monk Tapey set himself on fire on February 27, 2009. The self-immolations have mainly occurred in Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture in Sichuan (the Tibetan area of Amdo), with three in neighbouring Kardze (Chinese: Ganzi) Tibetan Autonomous Prefecture (the Tibetan area of Kham). Radio Free Asia reported that the former monk set himself ablaze in Khamar township in Chamdo, that his wife’s name is Dolma, and that he has two sons and a daughter."},
	{"id": 1, "name": "Palden Choetso", "date":"November 3, 2011", "age":"35", "location":"Tawu (also known as Dawu) county in Kardze, TAP, Sichuan", "status":"Deceased", "lat":"104.2", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Palden-Choetso-150a.jpg", "info": "A Tibetan, Palden Choetso set fire to herself November 3, 2011 and is believed to have died in Kardze (Chinese: Ganzi) Tibetan Autonomous Prefecture in Sichuan, the Tibetan area of Kham. The state news agency Xinhua confirmed the self-immolation and reported that the nun died after setting herself on fire near her nunnery in Tawu (also known as Dawu, Chinese: Daofu) county in Kardze. According to one source in exile, “After Palden Choetso’s self-immolation the nuns took her to the nunnery, and she died soon afterwards. Nuns began to pray for her. The local authorities have locked down the area, closing a major road in Tawu, and deploying troops to the nunnery.”"},
	{"id": 2, "name": "Dawa Tsering", "date":"October 25, 2011", "age":"38", "location":"Kardze county, Kardze TAP, Sichuan", "status":"Unknown", "lat":"102", "lon":"29.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Dawa-Tsering-150a.jpg", "info": "Dawa Tsering, 38, became the 11th Tibetan to self-immolate as a form of political protest against Chinese rule when he set fire to himself on the morning of October 25 in Kardze Monastery in eastern Tibet. Dawa Tsering was reportedly participating in a religious ritual inside the monastery attended by hundreds of local people when he set himself on fire. His current condition and whereabouts are not known, and Chinese police have reportedly surrounded the monastery."},
	{"id": 3, "name": "Tenzin Wangmo", "date":"October 17, 2011", "age":"20", "location":"Sumdo bridge, located below Mame nunnery, approximately three kilometers outside of Ngaba county town, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.2", "lon":"31.7", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tenzin-Wangmo-150.jpg", "info": "Tenzin Wangmo, a 20 year-old Tibetan nun from Mame Dechen Chokorling nunnery (also known as Mame nunnery) in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province (Tibetan region of Amdo), died after self-immolating at the Sumdo bridge, located below Mame nunnery, approximately three kilometers outside of Ngaba county town. According to the same sources, Tenzin Wangmo called for the Dalai Lama’s return to Tibet and for religious freedom, during a protest that lasted approximately 10 minutes. Tenzin Wangmo’s body was taken back to the nunnery before police arrived, whereupon the authorities demanded that her body be turned over or buried the same day, according to the same exile sources. The nuns of Mame nunnery refused, after which soldiers and police cordoned off the nunnery and surrounding villages. Details are still emerging, however, according to the same exile sources, Tenzin Wangmo’s body was cremated on the evening of October 17, by order of the authorities."},
	{"id": 4, "name": "Norbu Damdrul", "date":"October 15, 2011", "age":"19", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.2", "lon":"32.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Norbu-Damdrul-150.jpg", "info": "Norbu Damdrul, 19, a former Kirti monk, set fire to himself in a protest on the main street in Ngaba (Chinese: Aba) county town just before noon on October 15. According to exiled Tibetan sources he shouted “We need freedom and independence for Tibet,” and called for the return of the Dalai Lama to Tibet as his body was burning, according to the same sources. Norbu’s body was badly burned, but according to the same sources he was still alive when police stationed on the street extinguished the flames and kicked Norbu before taking him away. A large crowd of Tibetans who had gathered at the scene was dispersed at gunpoint by security personnel, according to the same sources."},
	{"id": 5, "name": "Choepel", "date":"October 7, 2011", "age":"19", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.3", "lon":"32.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Choepel-150.jpg", "info": "Choepel and Kayang, both former monks at Kirti monastery who may have been expelled, set fire to themselves along the main road of Ngaba county town. The two young men clasped their hands together and set fire to themselves before security personnel extinguished the flames and took the two to the county’s government-run hospital. Both young men died following the protest. The Chinese state media reported the self-immolation in a Xinhua report on October 8, saying that two Tibetans were “slightly injured” after a “self-immolation attempt.”"},
	{"id": 6, "name": "Kayang", "date":"October 7, 2011", "age":"18", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"102.4", "lon":"32", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Kayang-150.jpg", "info": "Choepel and Kayang, both former monks at Kirti monastery who may have been expelled, set fire to themselves along the main road of Ngaba county town. The two young men clasped their hands together and set fire to themselves before security personnel extinguished the flames and took the two to the county’s government-run hospital. Both young men died following the protest. Kayang’s cousin, a Tibetan named Tashi, was one of the Tibetans killed in the Chinese government crackdown in Ngaba in 2008. The Chinese state media reported the self-immolation in a Xinhua report on October 8, saying that two Tibetans were “slightly injured” after a “self-immolation attempt.”"},
	{"id": 7, "name": "Kelsang Wangchuk", "date":"October 3, 2011", "age":"17", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Tibetan exile sources indicate that he is in a ward of the county hospital under strict surveillance. The same sources said that he had sustained a head injury as a result of the beatings from police at the time of his detention.", "lat":"102.5", "lon":"31.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Kelsang-Wangchuk-150.jpg", "info": "A 17-year old monk from Kirti monastery immolated himself in Ngaba county town at approximately 2:00 pm local time on October 3, according to Tibetans in exile in contact with Tibetans in the area. The monk, Kelsang Wangchuk, carried a photo of the Dalai Lama and was shouting slogans against the Chinese government when he set fire to himself along the main street in Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province. Full details of the incident have yet to emerge, but some exiled sources say that he was immediately surrounded by security personnel, who extinguished the fire and beat Kelsang Wangchuk before taking him away. Kelsang’s current wellbeing and whereabouts are unknown. Shortly after the immolation, additional security forces were deployed in Ngaba county town and at Kirti monastery. According to monks from the re-established Kirti monastery in exile in Dharamsala, India, pamphlets were distributed and posted around Kirti monastery and the market place in Ngaba county town a few days ago, stating that if the current security crackdown in the area were to continue, “many more people were prepared to give up their lives” in protest."},
	{"id": 8, "name": "Lobsang Kelsang", "date":"September 26, 2011", "age":"Believed to be 18", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"In a hospital, according to exile Tibetan sources. Lobsang Kelsang was featured on Chinese state television from hospital.", "lat":"102.2", "lon":"31.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Lobsang-Kelsang-150.jpg", "info": "On September 26 Lobsang Kelsang and Lobsang Kunchok, both believed to be approximately 18-years old, set fire to themselves while shouting “Long live His Holiness the Dalai Lama,” in a protest also held in Ngaba county town. After extinguishing the flames, police took the two young monks into custody."},
	{"id": 9, "name": "Lobsang Kunchok", "date":"September 26, 2011", "age":"18", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"In a hospital, according to exile Tibetan sources.", "lat":"101.9", "lon":"31.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Lobsang-Kunchok-150.jpg", "info": "On September 26 Lobsang Kelsang and Lobsang Kunchok, both believed to be approximately 18-years old, set fire to themselves while shouting “Long live His Holiness the Dalai Lama,” in a protest also held in Ngaba county town. After extinguishing the flames, police took the two young monks into custody."},
	{"id": 10, "name": "Tsewang Norbu", "date":"August 15, 2011", "age":"29", "location":"Tawu county, Kardze Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"101.8", "lon":"31.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Tsewang-Norbu-150.jpg", "info": "Tsewang Norbu died after setting fire to himself and calling for freedom and the return of the Dalai Lama to Tibet. Tsewang Norbu drank petrol before immolating himself and died soon afterwards, according to Tibetan exiles in contact with the area. In a rare instance of prompt reporting on such an incident, the Chinese state media confirmed the death of a Buddhist monk shortly afterwards, with Xinhua stating: “it was unclear why he had burnt himself”, and that the local government had launched an investigation. (Xinhua, August 15). A hotel receptionist near the scene of Tsewang Norbu’s death told AFP that the monk had been distributing leaflets, saying: “I saw a monk lying on the ground and burning, he died right in front of the county government building.” (AFP, August 15). The state media confirmed that Tsewang Norbu had been swiftly cremated on Wednesday, August 17, evidence that the Kardze Party Secretary’s instructions for a prompt cremation were followed. Xinhua reported that Nyitso monk Tsewang Norbu (Chinese transliteration: Tsongwon Norbu) had been “cremated Wednesday in accordance with Tibetan rituals”, according to the local government. (Xinhua in English, August 17)."},
	{"id": 11, "name": "Phuntsog", "date":"March 16, 2011", "age":"20", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"101.6", "lon":"32.3", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Phuntsog-150.jpg", "info": "Phuntsog, a 20-year old monk, immolated himself on March 16, the 3rd anniversary of a protest at Kirti in 2008 during which at least 10 Tibetans were shot dead. Police extinguished the flames and were seen beating Phuntsog before he died, according to Tibetan exiles in contact with Tibetans in the area. According to Tibetan exiles who spoke to a witness of the protest, before he was stopped by police Phuntsog shouted slogans including “May His Holiness the Dalai Lama live for 10,000 years!” According to the same sources, protests then broke out against the Chinese authorities involving hundreds of monks and laypeople. After an attempted peaceful march from the monastery, police broke up the protests, detaining an unknown number of monks and beating Tibetans involved. An account of the aftermath of the self-immolation: Kirti monks intervened when police were beating Phuntsog and took him back to the monastery before ensuring he received medical treatment. The Chinese authorities’ official statement included the false claim that the monks “forcibly took [Phuntsog] out of the hospital.”"}
	]},
		{
		"year": "2011",
		"incidents":[
	{"id": 0, "name": "Tapey", "date":"February 27, 2009", "age":"Twenties", "location":"Ngaba county town, Ngaba county, Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan province", "status":"Unknown", "lat":"102.2", "lon":"31.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tapey-150.jpg", "info": "Tapey, a Kirti monk in his mid-twenties, was shot by security personnel when he set himself on fire as a form of protest after prayer ceremonies at his monastery were cancelled. Early in the afternoon, according to at least two sources including one who spoke to an eyewitness, Tapey walked alone to a nearby crossroads in the market area of the town. He had already doused himself with oil by the time he reached the crossroads. He then set himself on fire and raised a home-made Tibetan flag that had at its center a photograph of the Dalai Lama. When Tapey began to shout slogans (no details are yet known of what he said), People’s Armed Police (PAP) personnel stationed nearby opened fire, and Tapey fell to the ground. Reports indicate that the PAP extinguished the fire after Tapey was shot and he was immediately taken away by police."}



		]}
	]
}














