{
	"stuff":[
		{
		"year": "2016",
		"incidents":[
		{"id": 0, "name": "Kalsang Wangdu", "date":"February 29, 2016", "age":"18", "location":"Nyarong County in Kardze (Chinese: Ganzi)", "status":"Deceased", "lat":"99.59", "lon":"31.37", "img": "http://www.savetibet.org/wp-content/uploads/2016/03/Kalsang-Wangdu-150.jpg", "info": "[While he burned], he called out for Tibet’s complete independence,” a Tibetan source told RFA, adding that witnesses to Wangdu’s protest “intervened,” intending to take him to Sichuan’s provincial capital for treatment.He carried out his self-immolation around 4pm by his monastery, the Retsokha Aryaling monastery. (RFA report,A Tibetan monk named Kalsang Wangdu, aged 18, has died after setting himself on fire on February 29 (2016) in Nyarong County in Kardze (Chinese: Ganzi), eastern Tibet, according to Radio Free Asia."}
		]},
		{
		"year": "2015",
		"incidents":[
	{"id": 0, "name": "Tenzin Gyatso", "date":"May 20, 2015", "age":"Early thirties", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Unknown", "lat":"101", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2015/05/TenzinGyatsoTawu2-0520.jpg", "info": "A Tibetan father of four set fire to himself in Tawu apparently in response to tightened security in the buildup to the Dalai Lama’s 80th birthday. Tenzin Gyatso, the fourth Tibetan to self-immolate this year, was taken away by armed police and it is not known if he is still alive. He set fire to himself outside a government building where political education was carried out, according to Tibetan sources."},
	{"id": 1, "name": "Neykyab", "date":"April 16, 2015", "age":"Forties", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2015/04/neykyab-150.jpg", "info": "The Tibetan man was named by Tibetan sources as Neykyab, believed to be in his forties or fifties. The same sources said that he was the brother-in-law of another Tibetan from Ngaba, Dargye, who set fire to himself in Lhasa on May 27, 2012. A local source from Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) told Radio Free Asia: “He was protesting against Chinese policies in Tibet. His body was taken away by police.” Another source told RFA: “He had received [religious] recognition for his vow not to harm others in personal disputes—a vow that he took in honor of all those who have sacrificed themselves in self-immolation protests for the cause of Tibetan freedom” the source said.”"},
	{"id": 2, "name": "Sangye Tso", "date":"May 27, 2015", "age":"36", "location":"", "status":"Deceased", "lat":"102.9", "lon":"34.9", "img": "http://www.savetibet.org/wp-content/uploads/2015/06/Sangey-Tso-300.jpg", "info": "Sangye Tso set fire to herself and died on May 27 in a township in Chone (Chinese: Zhuoni) county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture) in Gansu Province, according to Tibetan sources. The location she chose to self-immolate was significant – outside a government building near the monastery of Tashi Choekhorling in Dorkok township. A Tibetan exile source in contact with Tibetans in the area said: “The specific location was the Party and government offices, including the local police station, symbolic to locals of policies of injustice against Tibetans, as well as the main offices to enforce the crackdown against police protest in 2008."},
	{"id": 3, "name": "Yeshi Kandro", "date":"April 8, 2015", "age":"Forties", "location":"", "status":"Believed Deceased", "lat":"101.9", "lon":"30", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Yeshi-Kandro-150.jpg", "info": "A Tibetan nun in her forties called Yeshi Kandro set fire to herself on April 8 in Kardze (Chinese: Ganzi) and is believed to have died, according to Tibetan sources. She called for the long life of the Dalai Lama, for the Dalai Lama to be invited to Tibet, and for freedom for Tibet as she set herself alight, according to the same sources."},
	{"id": 4, "name": "Norchuk", "date":"March 5, 2015", "age":"Late Forties", "location":"", "status":"Deceased", "lat":"104", "lon":"31.7", "img": "http://www.savetibet.org/wp-content/uploads/2015/03/Norshuk-150.jpg", "info": " A 40-year old Tibetan woman set herself on fire and died in a village in Ngaba (Chinese: Aba) on the night of March 5, in the first self-immolation in Tibet this year. Norchuk was from Dowa village in the Trotsik area of Ngaba (Chinese: Aba) county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan (in the Tibetan area of Amdo). Unusually, her body was not taken by the authorities but local people cremated her remains the next morning in order to pay their respects."},
	{"id": 5, "name": "Sonam Tobgya", "date":"July 9, 2015", "age":"Late twenties", "location":"", "status":"Unknown", "lat":"97", "lon":"33", "img": "", "info": "A Tibetan monk in his late twenties, Sonam Topgyal, set fire to himself in the main square of Kyegudo (Yushu) yesterday (July 9), in an atmosphere of heightened security imposed around the period of the Dalai Lama’s 80th birthday on July 6. According Tibetan exile sources, Sonam Topgyal was taken away by armed police while still alive and is believed to be in hospital, although his whereabouts and welfare is not known."},
	{"id": 6, "name": "Tashi Kyi", "date":"August 27, 2015", "age":"55", "location":"", "status":"Deceased", "lat":"102.5", "lon":"35.2", "img": "", "info": "Tibetan mother of four in her mid-fifties who set herself on fire on August 27 and died, apparently as a protest against China’s policies of relocation and demolition of housing. Tashi Kyi, described as a “generous Buddhist” who was “devoted to her family”, was a relative of a prominent monk who escaped into exile after a bold protest in 2008. Although local Tibetans attempted to save her life by extinguishing the blaze, Tashi Kyi died hours after setting herself on fire in her housing compound, a nomad settlement site in Sangkok township, Sangchu (Chinese: Xiahe) in Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu Province. Her body was taken away by the authorities."}		
		]},
		{
		"year": "2014",
		"incidents":[
	{"id": 0, "name": "Kalsang Yeshe", "date":"December 23, 2014", "age":"Late Twenties", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Deceased", "lat":"120", "lon":"29.7", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Kalsang-Yeshe-150x.jpg", "info": "A Tibetan monk known for his work teaching others about Buddhism set fire to himself and died today in Tawu, the Tibetan area of Kham, according to reports from Tibetans in exile. According to the same sources, Kalsang Yeshe self-immolated near a police station that had been established recently by his monastery, Nyitso, where repression of monks and local people has been particularly intense in recent years."},
	{"id": 1, "name": "Tseypey", "date":"December 22, 2014", "age":"19", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Tseypey-1222-150.jpg", "info": "She was identified by exile sources as Tseypey, the fourth of six children from a family in Meruma township, and the same sources say that she died on the scene. Tseypey was described by Tibetans who knew her as “well-behaved, honest and gentle”, according to Kirti monks in exile in Dharamsala. She had not received a formal education but grew up working as a herder with her parents. According to the same sources, her 60 year old father and 50 year old mother have reportedly been taken away by police, but it is not clear whether they have been detained."},
	{"id": 2, "name": "Sangye Khar", "date":"December 16, 2014", "age":"Unknown", "location":"", "status":"Unknown", "lat":"102.5", "lon":"35.2", "img": "http://www.savetibet.org/wp-content/uploads/2014/12/Sangye-Khar-150.jpg", "info": "Sangye Khar is believed to be from a semi-nomadic area in Kanlho, Gansu. Details of the self-immolation were sketchy due to security restrictions in the area."},
	{"id": 3, "name": "Lhamo Tashi", "date":"September 17, 2014", "age":"Early twenties", "location":"", "status":"Deceased", "lat":"102.9", "lon":"34.9", "img": "http://www.savetibet.org/wp-content/uploads/2014/09/Lhamo-Tashi-150.jpg", "info": "A Tibetan student, Lhamo Tashi, set fire to himself and has died on September 17 outside a government Public Security Bureau headquarters in Tsoe City, northeastern Tibet, where he was studying. After setting himself on fire at around midnight, Lhamo Tashi, who was in his early twenties, was taken away by police in Tsoe City, the capital of Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture in Gansu Province (the Tibetan area of Amdo)."},
	{"id": 4, "name": "Thinley Namgyal", "date":"April 15, 2014", "age":"32", "location":"", "status":"Deceased", "lat":"109.4", "lon":"19.1", "img": "http://www.savetibet.org/wp-content/uploads/2014/04/Thinley-Namgyal-150.jpg", "info": "A Tibetan man burned himself to death Tuesday in Sichuan province’s restive Kardze prefecture to protest Chinese rule, triggering a security alert and a clampdown on information flow, according to sources. Thinley Namgyal, 32, self-immolated at noon in Khangsar township in Tawu (in Chinese, Daofu) county in Kardze (Ganzi) Tibetan Autonomous Prefecture, the sources said."},
	{"id": 5, "name": "Phagmo Samdup", "date":"February 5, 2014", "age":"Late twenties", "location":"", "status":"Deceased", "lat":"101.4", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2014/02/Pakmo-Samdup-150.jpg", "info": "Phagmo Samdup set fire to himself at around 9:30pm in the evening. It appears that not many people were outside to witness the self-immolation. Police on patrol extinguished the fire and took Phagmo Samdup away, and it is not known if he survived, Tibetan sources said, adding he had been taken to Tsekhog county town."},
	{"id": 6, "name": "Lobsang Palden", "date":"March 16, 2014", "age":"20", "location":"", "status":"Unknown", "lat":"104.2", "lon":"31.3", "img": "http://www.savetibet.org/wp-content/uploads/2014/03/Lobsang-Palden-150.jpg", "info": "The monks, citing local contacts, said Palden self-immolated to protest “against the violent crackdown on the Tibetans” on March 16, 2008 in Ngaba when Chinese police opened fire on a crowd of Tibetans, killing at least 10, including one monk."},
	{"id": 7, "name": "Kunchok", "date":"September 16, 2014", "age":"42", "location":"", "status":"Hospitalized, Tsangkor town in Gade (Chinese: Gande) county in the Prefecture", "lat":"99.3", "lon":"34.1", "img": "", "info": "A 42 year-old Tibetan, Kunchok, set himself on fire outside a police station in the Golog (Chinese: Guoluo) Tibetan Autonomous Prefecture in Qinghai Province on September 16, according information received from Tibet. Kunchok’s self immolation took place in Tsangkor town in Gade (Chinese: Gande) county in the Prefecture but Tibetans nearby managed to extinguish the flames. Kunchok was rushed to hospital, and was deeply distressed that he had survived, according to Tibetan sources. Although the self-immolation happened on September 16, news only reached Tibetans in exile yesterday (October 5) due to restrictions on information and tightened security in the area."},
	{"id": 8, "name": "Dolma", "date":"March 29, 2014", "age":"31", "location":"Bathang county, Sichuan (the Tibetan area of Kham)", "status":"Unknown", "lat":"105", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2014/03/Dolma-0329-150.jpg", "info": "A Tibetan, reported to be 31-years-old, called Dolma set fire to herself outside a monastery on March 29, the first self-immolation in Bathang county, Sichuan (the Tibetan area of Kham). When Tibetans who were circumbulating the Ba Choede monastery, a traditional religious practice, witnessed the self-immolation, they managed to extinguish the flames and take Dolma to hospital."},
	{"id": 9, "name": "Jigme Tenzin", "date":"March 16, 2014", "age":"Late twenties", "location":"Tsekhog (Zeku) county in Qinghai province’s Malho (Huangnan) Tibetan Autonomous Prefecture", "status":"Deceased", "lat":"122", "lon":"36.9", "img": "", "info": "Monk Jigme Tenzin, who was in his late twenties, self-immolated on March 16, 2014 near his monastery, Sonak Gedun Tashi Choling in Tsekhog (Zeku) county in Qinghai province’s Malho (Huangnan) Tibetan Autonomous Prefecture. Jigme Tenzin’s self-immolation was noticed immediately by monks in the monastery, who rushed to extinguish the flames. But Jigme Tenzin died on the scene, and monks were only able to carry his body back to the monastery. After the self-immolation, armed police and officials came to the monastery and detained a group of monks. While some were released later that day, it is not known when the rest were released or whether any monks are still in custody. Patriotic education sessions were held at the monastery, and monks’ movements and religious activities were restricted for around two months. Immediately after the self-immolation, internet access and mobile phone networks were cut off. A Tibetan source who had known Jigme Tenzin for some years told ICT: “Jigme Tenzin had previously studied as a monk at Rongwo monastery in Rebkong and later returned to Sonak Gedun Tashi Choling monastery in his home area. He was a very humble person, and a vegetarian.”"},
	{"id": 10, "name": "Lobsang Dorje", "date":"February 13, 2014", "age":"25", "location":"Ngaba (Chinese: Aba) county town", "status":"Unknown", "lat":"103.8", "lon":"31.6", "img": "", "info": "A former Kirti monk set fire to himself on February 13, on the main road near the monastery in Ngaba (Chinese: Aba) county town, after attending a monastic mask dance that morning. Twenty-five year old Lobsang Dorje was still alive when he was taken away by police. Kirti monks in exile said: “As they were driving him away in the back of a pickup van covered with black canvas, he sat up and joined his palms, but the policemen pushed him back down. At present it is not known whether he is alive or dead, or where he has been taken.” Lobsang Dorje, from Chukle Gongma nomadic area in Cha Ruwa, Ngaba (Chinese: Aba) set fire to himself in the same street as Kirti monk Tapey, who was the first Tibetan in Tibet to self-immolate five years ago this month in February 2009."}
		]},
		{
		"year": "2013",
		"incidents":[
	{"id": 0, "name": "Tsultrim Gyatso", "date":"December 19, 2013", "age":"41", "location":"Tawu (Chinese: Daofu) county in Sichuan", "status":"Deceased", "lat":"102.5", "lon":"35.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/12/Tsultrim-Gyatso-150.jpg", "info": "A Tibetan monk from Amchok Monastery died of self-immolation protest on December 19, 2013 calling for unity among Tibetans and the return of the Tibetan spiritual leader His Holiness the Dalai Lama. He died instantly and soon local Tibetans and monks took his charred body to his monastery. Sources told TCHRD that over 400 monks have gathered at to recite prayers and conduct rituals at the deceased’s residence at the monastery. In his last note, Tsultrim Gyatso wrote that the reasons for his self-immolation protest are to call for the return of His Holiness the Dalai Lama to Tibet, release the 11th Panchen Lama Gedun Choekyi Nyima, and for the welfare of the six million Tibetans."},
	{"id": 1, "name": "Kunchok Tseten", "date":"December 4, 2013", "age":"", "location":"Ngaba (Chinese: Aba) county in Sichuan", "status":"Deceased", "lat":"104", "lon":"31", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Kunchok-Tseten-150.jpg", "info": "A Tibetan father of two called Kunchok Tseten set fire to himself yesterday (December 3) in Meruma township in Ngaba, sparking protests as local people tried to stop police taking him away after he collapsed in the road in flames. Kunchok Tseten’s wife and some relatives have disappeared and are believed to have been taken into custody, according to Tibetan exile sources. Kunchok Tseten was heard shouting loudly as he ran down the road ablaze, calling for the long life of the Dalai Lama, for His Holiness to return to Tibet and for Tibetans to be reunited both inside Tibet and in exile. A Tibetan with contacts in the area told Radio Free Asia: “Even after he collapsed on the ground, he was seen by local witnesses folding his hands together in prayer and uttering some words that were not audible.”"},
	{"id": 2, "name": "Kunchok Sonam", "date":"July 20, 2013", "age":"18", "location":"", "status":"Deceased", "lat":"117.9", "lon":"27.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/07/Konchok-Sonam-150.jpg", "info": "An 18-year old monk called Kunchok Sonam set himself on fire on July 20 and died outside his monastery in Dzoege, Ngaba, where the crackdown has been among the most intense in Tibetan areas. Kunchok Sonam was regarded as ‘exceptional’ in his studies. He had told friends that living under Chinese rule in Tibet had brought too much suffering. A heavy troop presence has now deployed in Thangkor (Ch: Tangke) town and at the Soktsang (Tashi Thekchokling) Gelugpa monastery in Dzoege (Chinese: Ruo’ergai) in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo) where Kunchok Sonam was a monk. Another Tibetan monk, Tangdzin, was detained, according to one Tibetan source. Radio Free Asia reported that hundreds of Tibetans have gathered at the monastery in support of monks who prevented Chinese authorities from taking away his body."},
	{"id": 3, "name": "Losang Dawa", "date":"April 24, 2013", "age":"20", "location":"", "status":"Deceased", "lat":"101.4", "lon":"32.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Lobsang-dawa-01-4242013-150.jpg", "info": "At around 6:40 pm on April 24 2013, two monks of the Taktsang Lhamo Kirti monastery, Losang Dawa, 20, and Konchok Woeser, 23, set themselves on fire in the monastery’s assembly hall. They shouted slogans of protest against the Chinese government and its policies in Tibet, and died immediately. The monks took their bodies to their rooms and said prayers for them. Local authorities have indicated that their remains must be cremated tomorrow."},
	{"id": 4, "name": "Konchok Woeser", "date":"April 24, 2013", "age":"23", "location":"", "status":"Deceased", "lat":"101.5", "lon":"32.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/konchok-woeser-01-4242013-150.jpg", "info": "At around 6:40 pm on April 24 2013, two monks of the Taktsang Lhamo Kirti monastery, Losang Dawa, 20, and Konchok Woeser, 23, set themselves on fire in the monastery’s assembly hall. They shouted slogans of protest against the Chinese government and its policies in Tibet, and died immediately. The monks took their bodies to their rooms and said prayers for them. Local authorities have indicated that their remains must be cremated tomorrow."},
	{"id": 5, "name": "Kalkyi", "date":"March 24, 2013", "age":"30", "location":"", "status":"Deceased", "lat":"101.1", "lon":"32.2", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Kalkyi-3242013-150.jpg", "info": "A 30-year old Tibetan woman called Kalkyi set fire to herself close to Jonang Gonchen monastery in Dzamthang (Chinese: Rangtang), Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo). Kalkyi died immediately afterwards, according to Tibetan exile sources, and local people took her body to the monastery for prayers."},
	{"id": 6, "name": "Shichung", "date":"September 28, 2013", "age":"40", "location":"Gomang village, Ngaba (Chinese: Aba) county", "status":"Deceased", "lat":"89.8", "lon":"31.4", "img": "http://www.savetibet.org/wp-content/uploads/2013/09/Shichung-150.jpg", "info": "A Tibetan father of two set fire to himself and died on September 28 in Gomang village, Ngaba (Chinese: Aba) county, according to exile Tibetan sources. When Tibetans gathered around his body, police aimed their guns at the crowd. Village elders averted tensions by appealing to both local Tibetans and police for calm. Forty-year old Shichung set himself on fire outside his house and ran along the road shouting in protest against the Chinese authorities before he collapsed to the ground in flames and died, according to Kirti monks in exile in Dharamsala. The monks said before he self-immolated, he lit a butter-lamp before an image of the Dalai Lama. A few days earlier, he had said, “The Chinese will never leave us in peace”, according to the same sources."},
	{"id": 7, "name": "Wangchen Dolma", "date":"June 11, 2013", "age":"Early thirties", "location":"Near Nyatso monastery in Tawu, Kardze Tibetan Autonomous Prefecture, Sichuan province", "status":"Deceased", "lat":"99.9", "lon":"31.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Wangchen-Dolma-150.jpg", "info": "A Tibetan nun has died after setting fire to herself on June 11 near a monastery in Tawu, eastern Tibet, during a gathering of several thousand monks for a religious debate and teaching. Wangchen Dolma chose to self-immolate not at her own mountain retreat, Barshab Dragkar, but near Nyatso monastery in Tawu (Chinese: Daofu) in Kardze (Chinese: Ganzi) Tibetan Autonomous Prefecture, Sichuan (the Tibetan area of Kham) at the time of a major inter-monastic debate and teaching. More than 3,000 monks from at least 50 monasteries representing all of the Buddhist schools are attending the teachings. After the self-immolation, communications were restricted in the area and surveillance of monks at Nyatso monastery was intensified."},
	{"id": 8, "name": "Tenzin Sherab", "date":"May 27, 2013", "age":"Early thirties", "location":"Gyaring area of Yushu in Qinghai province", "status":"Deceased", "lat":"97.4", "lon":"34.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tenzin-sherab-150.jpg", "info": "A Tibetan nomad in his early thirties called Tenzin Sherab set fire to himself and died on May 27 in the Gyaring area of Yushu in Qinghai province, according to exile Tibetan sources. Police took Tenzin Sherab’s body from the site of his self-immolation, but according to the same sources, they later released it to the family. The family were questioned on why they thought Tenzin Sherab had self-immolated."},
	{"id": 9, "name": "Chugtso", "date":"April 16, 2013", "age":"20", "location":"Tibetan area of Dzamthang (Chinese: Rangtang) county, Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"101.1", "lon":"32.3", "img": "", "info": ""},
	{"id": 10, "name": "Kunchok Tsomo", "date":"Late March, 2013", "age":"Early forties", "location":"Kyegudo (Chinese: Yushu) Tibetan Autonomous Prefecture, Qinghai province", "status":"Unknown", "lat":"97", "lon":"33", "img": "", "info": "Kunchok Tsomo self-immolated in late March in protest over the planned destruction of her home in Kyegudo, (Chinese: Yushu), in Qinghai, according to Radio Free Asia’s Tibetan service. On April 14, 2010, a 6.9-magnitude earthquake struck the area, killing 2,698 and leaving 100,000 homeless according to the official count. Kunchok Tsomo’s home was among those destroyed by the local authorities as part of the process of rebuilding Yushu as a ‘new city’ following the earthquake. She survived, and is under close official supervision, according to Tibetan sources. She is the third Tibetan from Kyegudo to self-immolate over land-rights issues involved in the reconstruction following the earthquake. According to a Tibetan source, armed police arrived on the scene of Kunchok Tsomo’s self-immolation quickly and extinguished the flames, and removed her to hospital. She was given urgent medical treatment and recovered, according to the same source. She is now back in her home town and under close official scrutiny. It is not known if her land was returned to her or not."},
	{"id": 11, "name": "Konchok Tenzin", "date":"March 26, 2013", "age":"28", "location":"Near Mokri monastery in Luchu (Chinese: Luqu) County, Gannan Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.5", "lon":"35", "img": "http://www.savetibet.org/wp-content/uploads/2013/05/Konchok-Tendzin-150.jpg", "info": "Konchok Tenzin was a monk at Mokri monastery, which he joined at a young age. Konchok died in the course of the protest, and his body was taken back to the monastery. In fear that the remains would be confiscated by the authorities, they were cremated the same night, according to Kirti monks in exile, in Dharamsala, India. Following the incident, security forces were deployed around the monastery and nearby villages in large numbers, and a strict crackdown imposed. This is the sixth self -immolation protest in Luchu county so far, and all the protesters involved have died as a result."},
	{"id": 12, "name": "Lhamo Kyab", "date":"March 25, 2013", "age":"43", "location":"Sangchu (Chinese: Xiahe), Gannan", "status":"Deceased", "lat":"102", "lon":"35", "img": "", "info": "A Tibetan forest guard set fire to himself and died on March 25 in Sangchu (Chinese: Xiahe), Gannan. The circumstances of his death remain unclear, but due to unofficial information received from the area, ICT includes this death on the list of self-immolations. In contrast to other self-immolators, Lhamo Kyab, a Tibetan man in his early forties, appears to have set fire to himself by pouring petrol over a pile of logs, setting them alight and placing himself amidst the flames, according to Tibetan sources in exile. He died in a rural area near his home in Meshul township, Sangchu (Chinese: Xiahe), Gannan in Gansu Province. An image received from Tibet depicts what can barely be discerned as human remains on bare earth, near a pile of wood, with denuded steep hillsides beyond. By the time he was found little remained of his body."},
	{"id": 13, "name": "Lobsang Thogme", "date":"March 16, 2013", "age":"28", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased", "lat":"102.2", "lon":"31.8", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Losang-Tokme-150.jpg", "info": "A 28-year old Kirti monk called Lobsang Thogme set fire to himself and died on Saturday, March 16, the fifth anniversary of a protest in Ngaba (Chinese: Aba), eastern Tibet, in which armed police fired into an unarmed crowd. He is the third Kirti monk to set fire to himself on the anniversary of the crackdown in 2008. In a translation from the Tibetan, the Kirti monks in exile said: “Before reaching the gate, he fell to the ground. By that time, many monks and laypeople reached the spot, and he was taken to the county hospital, but passed away soon after. It is not known what he shouted during his protest. On arrival at the hospital, a large force of police and soldiers came there and forcibly took possession of his remains, which they then took to the prefecture headquarters at Barkham (Chinese: Markam).”"},
	{"id": 14, "name": "Kunchok Wangmo", "date":"March 13, 2013", "age":"31", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Deceased. Details of the circumstances of the self-immolation remain unclear. It is not known if Kunchok Wangmo did self-immolate or not, due to restrictions on information and the oppressive political climate.", "lat":"102.3", "lon":"31.9", "img": "", "info": "The Chinese state media Xinhua reported on August 16, 2013, that the Intermediate People’s Court in Ngaba (Aba) Tibetan and Qiang Autonomous Prefecture had sentenced a Tibetan man, 32-year old Dolma Kyab (Chinese transliteration: Drolma Gya) to death for ‘killing his wife and burning her body to make it look as if she had self-immolated.’ Full details of the circumstances of Kunchok Wangmo’s death are not known. The imposition of the death penalty is rare in Tibet and there are concerns that the verdict may have been influenced by political circumstances."},
	{"id": 15, "name": "Sangdag", "date":"February 24, 2013", "age":"Unknown", "location":"On a road which is to the south of Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Unknown", "lat":"102.1", "lon":"32", "img": "", "info": "On February 24, 2013, a monk called Sangdag set fire to himself around 10:00am on a road which is to the south of Ngaba town. Sangdag was from Dowa village in Drotsig Shang, Ngaba Dzong, Ngaba prefecture in Sichuan province and was a monk from the Diphu monastery (Sakya school) in Ngaba Dzong."},
	{"id": 16, "name": "Tsesung Kyab", "date":"February 25, 2013", "age":"Late twenties", "location":"Shitsang Gonsar monastery in Luchu County, Gannan Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.7", "lon":"34.8", "img": "", "info": "Tsesung Kyab set fire to himself on February 25 in front of the main temple of Shitsang Gonsar monastery in Luchu. Harrowing images received from inside Tibet today depict Tsesung Kyab ablaze outside the temple as pilgrims look on. Many Tibetans were at the monastery for a prayer ceremony and ritual in which monks carry the Buddha’s statue and circumambulate the monastery. The images do not depict police attempting to extinguish the flames although, according to Tibetan exile sources, there was a police presence at the monastery. According to the same sources, his body was taken to his home in Choekhor village for prayers."},
	{"id": 17, "name": "Phagmo Dundrup", "date":"February 24, 2013", "age":"Early twenties", "location":"Chachung monastery in Tsoshar Prefecture in Qinghai province", "status":"Deceased", "lat":"102.1", "lon":"36.5", "img": "", "info": "Phagmo Dundrup self-immolated on February 24 evening when hundreds of Tibetans were present at the Chachung monastery, an important and ancient Gelugpa monastery, for a traditional prayer ceremony and presentation of butter-lamps of the Buddha and other deities. According to information from Tibetan sources in exile, monks tried to extinguish the flames after Phagmo Dondrup set himself ablaze. The monks took him to the hospital but he passed away last night in a hospital in Xining."},
	{"id": 18, "name": "Rinchen", "date":"February 19, 2013", "age":"17", "location":"Dzoege township, Ngaba county, eastern Tibet", "status":"Deceased", "lat":"91.6", "lon":"32.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/rinchen-02192013.jpg", "info": "Rinchen, 17 years old Tibetan, died February 19 after setting himself on fire in Ngaba. He was accompanied by Sonam Dhargye, 18 years, who also set himself on fire in protest against the Chinese government in Dzoege township, Ngaba county, eastern Tibet around 9.30pm (local time). According to the same sources, the families were able to recover their bodies. Rinchen and Sonam both went primary school in Kyangtsa township. Rinchen had been working away from home and returned for the Tibetan New Year (Losar) holiday."},
	{"id": 19, "name": "Sonam Dhargye", "date":"February 19, 2013", "age":"18", "location":"Dzoege township, Ngaba county, eastern Tibet", "status":"Unknown", "lat":"91.7", "lon":"32.5", "img": "", "info": "Rinchen, 17 years old Tibetan, died February 19 after setting himself on fire in Ngaba. He was accompanied by Sonam Dhargye, 18 years, who also set himself on fire in protest against the Chinese government in Dzoege township, Ngaba county, eastern Tibet around 9:30pm (local time). According to the same sources, the families were able to recover their bodies. Rinchen and Sonam both went primary school in Kyangtsa township. Rinchen had been working away from home and returned for the Tibetan New Year (Losar) holiday."},
	{"id": 20, "name": "Namlha Tsering", "date":"February 17, 2013", "age":"49", "location":"Labrang, Gansu (the Tibetan area of Amdo)", "status":"Unknown", "lat":"105.2", "lon":"35.2", "img": "", "info": "A 49-year old Tibetan man called Namlha Tsering set himself on fire today in the main street of Labrang, Gansu (the Tibetan area of Amdo), which is not far from Labrang monastery. Images emerged showing a man huddled on the road amidst traffic with his body ablaze. Chinese police and paramilitary arrived quickly on the scene and removed Namlha Tsering. It is not yet known whether he is still alive."},
	{"id": 21, "name": "Drugpa Khar", "date":"February 13, 2013", "age":"Twenties", "location":"Amchok town in Sangchu (Xiahe) county in Kanlho (Gannan) Tibetan Autonomous Prefecture, Gansu", "status":"Deceased", "lat":"102.5", "lon":"34.9", "img": "", "info": "Drugpa Khar, who was in his twenties, doused himself in gasoline and set himself on fire in Amchok town in Sangchu (Xiahe) county in Kanlho (Gannan) Tibetan Autonomous Prefecture, Gansu, on the third day of Tibetan New Year (February 13), according to Tibetan sources in exile and Radio Free Asia’s Tibetan language service. Drugpa Khar was a father of three children aged between one year old and six. He was born in Lushu Kyi village in Tsoe, Kanlho, theTibetan area of Amdo."},
	{"id": 22, "name": "Lobsang Namgyal", "date":"February 3, 2013", "age":"Mid-thirties", "location":"Outside the Public Security Bureau of Dzoege (Chinese: Ruergai/Zoige) County in Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan Province", "status":"Deceased", "lat":"101.7", "lon":"31.9", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/lobsang-namgyal-150.jpg", "info": "Lobsang Namgyal had been a monk at Kirti monastery in Ngaba, his ashes have not been returned to his family, according to the monks. Lobsang Namgyal was known as an exceptional student at Kirti monastery who had been tipped to study for the highest qualification in Tibetan Buddhism, a Geshe degree. “He was regarded as a model for a new generation of students at Kirti,” the Kirti monks in exile said in a statement in Tibetan."},
	{"id": 23, "name": "Konchok Kyab", "date":"January 22, 2013", "age":"26", "location":"Bora, Sangchu county, Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture in Gansu province", "status":"Deceased", "lat":"102.7", "lon":"35.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/Konchok-Kyab-01222013-150.jpg", "info": "Konchok Kyab [also known as Konba], age 26 set fire to himself around noon on January 22 to protest China’s policy on Tibet and he passed away after the incident. Konchok Kyab set fire to himself between the local moanstery and Bora Shang, Konchok Kyab was from the Gyara village in Bogtsa unit in Bora Shang, Sangchu Dzong, Gannan prefecture in Gansu province."},
	{"id": 24, "name": "Tsering Phuntsok", "date":"January 18, 2013", "age":"Twenties", "location":"Drachen village, Marthong county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province", "status":"Deceased", "lat":"101.5", "lon":"32", "img": "", "info": "A man in his twenties who has been named as Tsering Phuntsok (also known as Drupchak) set himself on fire in Drachen village, Marthong county, Ngaba Tibetan and Qiang Autonomous Prefecture in Sichuan province. He passed away at the scene and his body was taken away by Chinese police, according to Tibetan exile sources. He is survived by his wife and two children."},
	{"id": 25, "name": "Tsering Tashi", "date":"January 12, 2013", "age":"22", "location":"Main street of Amchok township, Sangchu (Chinese: Xiahe) county, Gannan Tibetan Autonomous Prefecture, Gansu province (the traditional Amdo area of Tibet)", "status":"Deceased", "lat":"102.2", "lon":"34.7", "img": "", "info": "Following Tsering Tashi’s self-immolation in the main street of Amchok township on January 12, Chinese police and Public Security Bureau officials arrived in several vehicles. They barred the monks of Amchok monastery and local lay Tibetans from offering prayers and ordered Tsering Tashi’s family members to cremate the body as soon as possible. When the family initially said that they needed to perform the customary religious rituals for a death, they were threatened and told that they would be responsible for the consequences if they refused. Tsering Tashi was married to Yumtso Kyi and is survived by his wife, parents and two sisters. He was described by Tibetans who knew him as “good-natured and polite” with a keen passion for horses and horse racing."}
	]},
		{
		"year": "2012",
		"incidents":[
	{"id": 0, "name": "Wangchen Kyi", "date":"December 9, 2012", "age":"17", "location":"Dokarmo nomadic area of Tsekhog (Chinese: Zeku) county in Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai (the Tibetan area of Amdo)", "status":"Deceased", "lat":"102", "lon":"35.5", "img": "", "info": "Seventeen year old student Wangchen Kyi died after setting fire to herself at around 8 pm in the evening on December 9 in the Dokarmo nomadic area of Tsekhog (Chinese: Zeku) county in Malho (Chinese: Huangnan) Tibetan Autonomous Prefecture in Qinghai (the Tibetan area of Amdo. Wangchen Kyi called for the long life of the Dalai Lama and of the Tibetan people as she set herself ablaze, according to reports from exile Tibetans in contact with people in the area."},
	{"id": 1, "name": "Kunchok Pelgye", "date":"December 8, 2012", "age":"24", "location":"Taktsang Lhamo Kirti monastery in Dzoege, in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo)", "status":"Deceased", "lat":"101.5", "lon":"30", "img": "", "info": "24-year old monk Kunchok Pelgye set himself on fire outside the main assembly hall of the Taktsang Lhamo Kirti monastery in Dzoege, in Ngaba Tibetan and Qiang Autonomous Prefecture, Sichuan (the Tibetan area of Amdo). Kirti monks in exile told ICT: “As he self-immolated, monks present gathered around him in shock and began to recite a prayer that is usually said in Kirti Rinpoche’s honor. His remains were carried back to his room in the monastery, and the hundreds of monks present continued to chant prayers dedicated to him.”"},
	{"id": 2, "name": "Pema Dorjee", "date":"December 8, 2012", "age":"23", "location":"Close to the main assembly hall of Shitsang Garser monastery in Luchu (Chinese: Luqu) in Gannan Tibetan Autonomous Prefecture, Gansu province.", "status":"Deceased", "lat":"102", "lon":"34.6", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/pema-dorjee-150.jpg", "info": "Pema Dorjee lived around 30 kilometers from the monastery and had gone there to pray at the time of the anniversary of Tsongkhapa’s passing. At the time of his self-immolation there were many people at the monastery. Pema Dorjee shouted that the Dalai Lama should be allowed to return to Tibet, and called for the unity of the Tibetan people. According to Tibetan exile sources, Pema Dorjee left his photos and identity card with his motorbike before his self-immolation."},
	{"id": 3, "name": "Lobsang Geleg", "date":"December 3, 2012", "age":"29", "location":"Pema county town, Golog prefecture, Qinghai province", "status":"Deceased", "lat":"99.3", "lon":"34.3", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/lobsang-gendun-150.jpg", "info": "Lobsang Geleg, aged 29, set fire to himself on December 3 at the main intersection in Pema county town and died at the scene. Before his death Lobsang Geleg shouted slogans and looked to bring his hands together in prayer, according to a local Tibetan who spoke with Tibetans in exile. In what has become an increasingly common response, state security personnel attempted to remove Lobsang Geleg’s body, but were stopped by a gathering of local Tibetans, who took the body to the local monastery for prayers. Lobsang Geleg (informally known as Loge) was a monk at Pema Gonka Dagtroe Lin monastery, in Pema (Chinese: Padma) county, Golog (Chinese: Guoluo) Tibetan Autonomous Prefecture, Qinghai province."},
	{"id": 4, "name": "Sungdue Kyab", "date":"December 2, 2012", "age":"17", "location":"Bora", "status":"Survived", "lat":"102.4", "lon":"36", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/sungdue-kyab-150.jpg", "info": "A young Tibetan man set fire to himself along the road to Bora monatery, in Sangchu county, on December 2, according to Tibetans in exile in contact with Tibetans in Tibet. Sungdue Kyab, 17-years old, is married with a 2-year old son. Sungdue Kyab survived his protest and was taken away by police, reportedly to the hospital in the city of Tsoe in Kanlho (Chinese: Gannan) Tibetan Autonomous Prefecture, Gansu province. Local Tibetans and monks from Bora monastery gathered at the site of the protest, when the scene became very tense, according to the same Tibetan sources."},
	{"id": 5, "name": "Kunchok Kyab", "date":"November 30, 2012", "age":"29", "location":"Ngaba (Chinese: Aba) Tibetan and Qiang Autonomous Prefecture, Sichuan", "status":"Presumed deceased", "lat":"102.3", "lon":"31", "img": "", "info": "Kunchok Kyab, a 29 year old man, carried out a self-immolation protest on November 30, 2012 in Ngaba. Kyab was taken away by security forces and his condition is unknown at present. A number of Tibetans who approached the security forces to demand the return of Kunchok Kyab are missing and presumed to be detained."},
	{"id": 6, "name": "Tsering Namgyal", "date":"November 29, 2012", "age":"31", "location":"Luchu region of eastern Tibet", "status":"Deceased", "lat":"104.5", "lon":"35.4", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/tsering-namgyal-150.jpg", "info": "Sources have identified the Tibetan as Tsering Namgyal, 31, a father of two, from Zamtsa Lotso Dewa region of Luchu. “Tsering Namgyal set himself on fire near the local Chinese government office in Luchu earlier today for the cause of Tibet,” Sonam, a Tibetan monk living in south India told Phayul, citing sources in the region. “Tsering Namgyal passed in his fiery protest.”"},
	{"id": 7, "name": "Wande Khar", "date":"November 28, 2012", "age":"21", "location":"Tsoe region of Kanlho, eastern Tibet", "status":"Deceased", "lat":"102.8", "lon":"36.2", "img": "", "info": "According to eyewitnesses, Wande Khar raised slogans calling for the return of His Holiness the Dalai Lama to Tibet, the release of Panchen Lama, freedom for Tibet, and the protection of Tibet’s environment."},
	{"id": 8, "name": "Sanggye Tashi", "date":"November 27, 2012", "age":"18", "location":"Sang Khog, Labrang [Tib:Sangchu Zdong Ch: Xiahe Xian], Gannan prefecture in Gansu province", "status":"Deceased", "lat":"103", "lon":"36.1", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/sanggye-tashi-150.jpg", "info": "Details are still emerging."},
	{"id": 9, "name": "Kelsang Kyab", "date":"November 27, 2012", "age":"24", "location":"Kyangtsa township, Ngaba", "status":"Deceased", "lat":"101.9", "lon":"31.7", "img": "", "info": "During the early evening hours of November 27, Keslang Kyab self-immolated in protest outside a government office building in Kyangtsa township in Ngaba, according to Tibetan monks living in exile who are in contact with Tibetans in the area. As Kelsang Kyab neared the government office building, he doused himself with petrol and shouted slogans, including, “May the Dalai Lama live for 100 aeons! May Kirti Rinpoche live for 100 aeons!” He set himself alight as he approached the front of the building and died at the scene. Following the protest, armed security forces were deployed and blocked off the town of Kyangtsa. The 24-year old Kelsang Kyab was the third of six children and grew-up a herdsman. Following his self-immolation, local Tibetans returned his body to his home near Kyangtsa township in Dzoege (Chinese: Ruanggui) county, Ngaba (Chinese: Aba) Tibetan Autonomous Prefecture, Sichuan province."},
	{"id": 10, "name": "Gonpo Tsering", "date":"November 26, 2012", "age":"24", "location":"Luchu county, Kanlho prefecture, Gansu province", "status":"Unknown", "lat":"102", "lon":"36.5", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/gonpo-tsering-150.jpg", "info": "Details are still emerging."},
	{"id": 11, "name": "Kunchok Tsering", "date":"November 26, 2012", "age":"18", "location":"Labrang, Tibetan Autonomous Prefecture, Gansu province (Tibetan area of Amdo)", "status":"Deceased", "lat":"99", "lon":"39", "img": "http://www.savetibet.org/wp-content/uploads/2013/06/kunchok-tsering-150.jpg", "info": "Kunchok Tsering, 18, passed away in his self-immolation protest today in Amchok region of Labrang, eastern Tibet. He carried out his protest near a mining site in the region, the same place where Tsering Dhondup, 35, father of three, passed away in his fiery protest on November 20. Kunchok Tsering is survived by his wife, Sangay Tso, 19 and parents Phagkyab, 40 and Gonpo Tso, 37, and an elder brother."},
	{"id": 12, "name": "Wangyal", "date":"November 26, 2012", "age":"Twenties", "location":"Serthar, north-eastern Tibet", "status":"Unknown", "lat":"97", "lon":"36", "img": "", "info": "Wangyal, a Tibetan man in his 20s, have set himself on fire in protest against the Chinese government in Serthar, north-eastern Tibet. Wangyal set himself on fire in front of the golden-horse statue at the local ground in Serthar. Chinese authorities immediately arrived at the immolation site and took away Wangyal’s body, eyewitnesses said. His current whereabouts and status is unavailable."},
	{"id": 13, "name": "Sangay Dolma", "date":"November 25, 2012", "age":"Unknown", "location":"In front of the Chinese government office in Dokarmo town of Tsekhog, Malho, eastern Tibet", "status":"Deceased", "lat":"102.4", "lon":"35.5", "img": "", "info": "A Tibetan nun set herself on fire in an apparent protest against China’s occupation of Tibet on Sunday, November 25. Sources tell Phayul that Sangay Dolma, a nun, passed away in her self-immolation protest in front of the Chinese government office in Dokarmo town of Tsekhog, Malho, eastern Tibet. The exact time of her self-immolation protest could not be ascertained immediately."}

		]}
	]
}














